{"version":"1","records":[{"hierarchy":{"lvl1":"FAQs"},"type":"lvl1","url":"/about/faqs","position":0},{"hierarchy":{"lvl1":"FAQs"},"content":"","type":"content","url":"/about/faqs","position":1},{"hierarchy":{"lvl1":"FAQs","lvl2":"1. How is sharing  through Nucleus different from existing options?"},"type":"lvl2","url":"/about/faqs#id-1-how-is-sharing-through-nucleus-different-from-existing-options","position":2},{"hierarchy":{"lvl1":"FAQs","lvl2":"1. How is sharing  through Nucleus different from existing options?"},"content":"Traditional means of sharing know-how do not serve the needs of the cell-free and synthetic cell communities. Traditional publishing can take years to share important immediate results or negative results. Further, useful information is often buried deep within PDFs or not available at all, slowing down the process of research. Nucleus is intended to be a knowledge sharing platform that emphasizes reproducibility and accessibility that should improve the quality of research and complement existing knowledge sharing practices.","type":"content","url":"/about/faqs#id-1-how-is-sharing-through-nucleus-different-from-existing-options","position":3},{"hierarchy":{"lvl1":"FAQs","lvl2":"2. How do I adhere to Nucleus open source and open science practices?"},"type":"lvl2","url":"/about/faqs#id-2-how-do-i-adhere-to-nucleus-open-source-and-open-science-practices","position":4},{"hierarchy":{"lvl1":"FAQs","lvl2":"2. How do I adhere to Nucleus open source and open science practices?"},"content":"Using a DevNote to submit a contribution makes it easy to follow our open source and open science practices. Checkout \n\nOpen science, \n\nNucleus Hub, \n\nDeveloper Notes for more information. If you’d like to get started as a Nucleus Developer, reach out to  \n\nbuild@bnext.bio and we would be happy to have a conversation.","type":"content","url":"/about/faqs#id-2-how-do-i-adhere-to-nucleus-open-source-and-open-science-practices","position":5},{"hierarchy":{"lvl1":"FAQs","lvl2":"3. What if I have a module that I want to contribute but is subject to a patent?"},"type":"lvl2","url":"/about/faqs#id-3-what-if-i-have-a-module-that-i-want-to-contribute-but-is-subject-to-a-patent","position":6},{"hierarchy":{"lvl1":"FAQs","lvl2":"3. What if I have a module that I want to contribute but is subject to a patent?"},"content":"This depends on who is the patent holder. If your university holds the patent you may have to petition them to license the contribution using a suitable tool that provides a patent license (e.g. \n\nCERN-OHL-P-2.0). In general, unless a technology is being actively commercialized, a patent can hinder innovation if it prevents the technology from being used by others. Open access licensing will help fulfill the goals of making technology available for the public benefit in such instances.","type":"content","url":"/about/faqs#id-3-what-if-i-have-a-module-that-i-want-to-contribute-but-is-subject-to-a-patent","position":7},{"hierarchy":{"lvl1":"FAQs","lvl2":"4. What if I want to patent something built with Nucleus components?"},"type":"lvl2","url":"/about/faqs#id-4-what-if-i-want-to-patent-something-built-with-nucleus-components","position":8},{"hierarchy":{"lvl1":"FAQs","lvl2":"4. What if I want to patent something built with Nucleus components?"},"content":"Our licensing scheme allows this. We want Nucleus to encourage innovation including patents. However, we hope that Nucleus can function as a “take a penny, leave a penny” to enable the broader community.","type":"content","url":"/about/faqs#id-4-what-if-i-want-to-patent-something-built-with-nucleus-components","position":9},{"hierarchy":{"lvl1":"FAQs","lvl2":"5. Will posting on Nucleus affect my ability to publish?"},"type":"lvl2","url":"/about/faqs#id-5-will-posting-on-nucleus-affect-my-ability-to-publish","position":10},{"hierarchy":{"lvl1":"FAQs","lvl2":"5. Will posting on Nucleus affect my ability to publish?"},"content":"DevNotes are regarded as preprints and do not count as previously published content. In general, if a journal accepts content that has been previously placed on a preprint server, then they should also accept content that has been shared as a DevNote. Of course, you should check specific journal policies to be sure.\n\nDevNotes are intended to complement existing publishing practices. For example,\n\nValidating a component in your own hands that has been described in a previous publication.\n\nSharing negative results that might never make it into a publication.\n\nDocumenting small tips and tricks that typically fall outside the scope of existing journals\n\nServing as a user friendly guide for sharing results after publication to increase impact and usability of parts and data\n\nNucleus is a great way for sharing the reproduction of an existing result while also providing the community with valuable, high quality data and user experience. Users may be required to disclose if they have disseminated components of a manuscript using preprint services  (e.g. \n\nACS journals).","type":"content","url":"/about/faqs#id-5-will-posting-on-nucleus-affect-my-ability-to-publish","position":11},{"hierarchy":{"lvl1":"FAQs","lvl2":"6. Do you sell contributed materials to customers?"},"type":"lvl2","url":"/about/faqs#id-6-do-you-sell-contributed-materials-to-customers","position":12},{"hierarchy":{"lvl1":"FAQs","lvl2":"6. Do you sell contributed materials to customers?"},"content":"Our aim with Nucleus is to provide the materials at cost. In the most permissive arrangement, we would be able to include the contributed components into products but so would the people to whom we ship materials and any other interested party.","type":"content","url":"/about/faqs#id-6-do-you-sell-contributed-materials-to-customers","position":13},{"hierarchy":{"lvl1":"FAQs","lvl2":"7. Does the OpenMTA stipulate that people that get this material cannot resell it?"},"type":"lvl2","url":"/about/faqs#id-7-does-the-openmta-stipulate-that-people-that-get-this-material-cannot-resell-it","position":14},{"hierarchy":{"lvl1":"FAQs","lvl2":"7. Does the OpenMTA stipulate that people that get this material cannot resell it?"},"content":"Biotechnology protection has two components: intellectual property (patents and copyright) and contracts (material transfer agreements). The OpenMTA stipulates that the materials can be transferred and used for any purpose, even commercial. However, it contains no implied license - meaning patent rights/licenses must also be obtained to use OpenMTA materials for commercial use. The utility of OpenMTA is most apparent when a biological material is in the public domain (e.g. after patent expiry) – it’s transfer and use can be still be restricted by MTAs (which typically have no limits on duration).","type":"content","url":"/about/faqs#id-7-does-the-openmta-stipulate-that-people-that-get-this-material-cannot-resell-it","position":15},{"hierarchy":{"lvl1":"License"},"type":"lvl1","url":"/about/license","position":0},{"hierarchy":{"lvl1":"License"},"content":"The Nucleus Distribution is licensed under the \n\nCERN-OHL-P-2.0","type":"content","url":"/about/license","position":1},{"hierarchy":{"lvl1":"License","lvl2":"OpenMTA"},"type":"lvl2","url":"/about/license#openmta","position":2},{"hierarchy":{"lvl1":"License","lvl2":"OpenMTA"},"content":"This Open Material Transfer Agreement (the “OpenMTA”) and the attached Implementing Letter (the “Implementing Letter” and, together with the OpenMTA, the “Agreement”) is entered into between the Provider and the Recipient (or the “Parties”, as further identified in the Implementing Letter) and governs the exchange and use of certain materials specified in this Agreement between the Parties. The provisions of this OpenMTA shall be given precedence in interpretation in the event of any conflict between this OpenMTA and the Implementing Letter.\n\nI. DEFINITIONS:\n\nProvider: Organization providing the Original Material. The name and address of this party will be specified in an implementing letter.\n\nProvider Scientist: The name and address of this party will be specified in an implementing letter.\n\nRecipient: Organization receiving the Original Material. The name and address of this party will be specified in an implementing letter.\n\nRecipient Scientist: The name and address of this party will be specified in an implementing letter.\n\nOriginal Material: The description of the Material being transferred will be specified in an implementing letter.\n\nMaterial: Original Material, Progeny, and Unmodified Derivatives. The Material shall not include: (a) Modifications, or (b) other substances created by the Recipient through the use of the Material, which are not Modifications, Progeny, or Unmodified Derivatives.\n\nProgeny: Unmodified descendant from the Material, such as virus from virus, cell from cell, or organism from organism.\n\nUnmodified Derivatives: Substances created by the Recipient which constitute an unmodified functional subunit or product expressed by the Original Material. Some examples include: subclones of unmodified cell lines, purified or fractionated subsets of the Original Material, proteins expressed by DNA/RNA supplied by Provider, or monoclonal antibodies secreted by a hybridoma cell line.\n\nModifications: Substances created by the Recipient which contain/incorporate the Material.\n\nCommercial Purposes: The sale, lease, license, or other transfer of the Materials or Modifications to a for-profit organization. Commercial Purposes shall also include uses of the Material or Modifications by any organization, including Recipient, to perform contract research, to produce or manufacture products for general sale, or to conduct research activities that result in any sale, lease, license, or transfer of the Material or Modifications to a for-profit organization.\n\nII. TERMS AND CONDITIONS OF THIS AGREEMENT\n\nThe Provider is making the Material available as a service to the research community. The Recipient may use the Material for any lawful purpose, including Commercial Purposes, in accordance with the following terms and conditions:\n\nUse: The Recipient shall use, store, and dispose of the Material and any Modifications in accordance with good laboratory practice and shall ensure compliance with all applicable laws, rules, and regulations, including laws, rules, and regulations governing export control and safety.\n\nAttribution: The Recipient agrees to provide appropriate acknowledgement of the source of the Material as requested by the Provider. Any request for attribution will be specified in an implementing letter.\n\nDistribution: The Recipient may distribute the Material and substances created by the Recipient through use of the Material, including Progeny, Unmodified Derivatives, and Modifications, without requesting consent from the Provider. Recipient agrees to notify the Provider of any distributions of the Material to third parties as requested by the Provider. Any request for notification will be specified in an implementing letter.\n\nFees: The Material is provided at no cost, or with an optional transmittal fee solely to reimburse the Provider for its preparation and distribution costs. If a fee is requested, the amount will be specified in an implementing letter.\n\nNo Implied License: Except for the rights expressly granted herein, the Recipient agrees that no other rights or licenses, whether express or implied, are granted to the Recipient under any patent, patent application, or other proprietary right of the Provider. As between the parties, each retains all right, title, and interest in works and inventions made by its personnel, and nothing herein shall be construed to transfer ownership of any invention, patent, patent application, or other proprietary right.\n\nLiability: Except to the extent prohibited by law, the Recipient assumes all liability for damages that may arise from the use, storage or disposal of the Material. The Provider will not be liable to the Recipient for any loss, claim or demand made by the Recipient, or made against the Recipient by any other party, due to or arising from the use of the Material by the Recipient, except to the extent permitted by law when caused by the gross negligence or willful misconduct of the Provider.\n\nNo Warranties: Any Material delivered pursuant to the Agreement is understood to be experimental in nature and may have hazardous properties. THE PROVIDER MAKES NO REPRESENTATIONS AND EXTENDS NO WARRANTIES OF ANY KIND, EITHER EXPRESSED OR IMPLIED. THERE ARE NO EXPRESS OR IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE, OR THAT THE USE OF THE MATERIAL WILL NOT INFRINGE ANY PATENT, COPYRIGHT, TRADEMARK, OR OTHER PROPRIETARY RIGHTS.\n\nIII. ADDITIONAL TERMS\n\nRecipient agrees to provide appropriate acknowledgement of the source of the Material in all publications.\n\nRecipient agrees to notify the Provider upon redistribution of the Material to third parties.","type":"content","url":"/about/license#openmta","position":3},{"hierarchy":{"lvl1":"Open Science"},"type":"lvl1","url":"/about/open-science","position":0},{"hierarchy":{"lvl1":"Open Science"},"content":"Here is our vision of open science. Open science is more than just early access to manuscripts, it is a holistic approach towards science that is guided towards the following the technical roadmap","type":"content","url":"/about/open-science","position":1},{"hierarchy":{"lvl1":"Release Notes"},"type":"lvl1","url":"/about/release-notes","position":0},{"hierarchy":{"lvl1":"Release Notes"},"content":"🎊 What’s new in v0.4.0\n\n🎊 What’s new in v0.3.0\n\n🎊 What’s new in v0.2.1\n\n🎊 What’s new in v0.2.0\n\n🎊 What’s new in v0.1.1","type":"content","url":"/about/release-notes","position":1},{"hierarchy":{"lvl1":"DNA Distribution"},"type":"lvl1","url":"/docs/dna-distro","position":0},{"hierarchy":{"lvl1":"DNA Distribution"},"content":"TODO...","type":"content","url":"/docs/dna-distro","position":1},{"hierarchy":{"lvl1":"Instance (Instance Name)"},"type":"lvl1","url":"/docs/implementations/implementation-first/implementation-first","position":0},{"hierarchy":{"lvl1":"Instance (Instance Name)"},"content":"","type":"content","url":"/docs/implementations/implementation-first/implementation-first","position":1},{"hierarchy":{"lvl1":"Instance (Instance Name)","lvl2":"Overview"},"type":"lvl2","url":"/docs/implementations/implementation-first/implementation-first#overview","position":2},{"hierarchy":{"lvl1":"Instance (Instance Name)","lvl2":"Overview"},"content":"Transcription factor modules bind to regulatory sequences upstream of coding regions, initiating RNA polymerase recruitment modules and gene expression cascades. Mitochondrial cristae modules facilitate oxidative phosphorylation through electron transport chain complexes, generating ATP via chemiosmotic gradient modules. Ribosomal subunit modules assemble on messenger RNA templates, catalyzing peptide bond formation between amino acids during translation elongation modules. Membrane-bound vesicle modules transport cargo proteins through endoplasmic reticulum and Golgi apparatus modules, undergoing post-translational modification modules including glycosylation and phosphorylation. Cell cycle checkpoint modules monitor DNA replication fidelity and chromosome segregation modules, preventing genomic instability through tumor suppressor pathway modules. Enzymatic cascade modules regulate metabolic flux through glycolysis and citric acid cycle modules, coordinating cellular energy production with biosynthetic demand modules.\n\n\n\nThis is a schematic of the module of the system.","type":"content","url":"/docs/implementations/implementation-first/implementation-first#overview","position":3},{"hierarchy":{"lvl1":"Instance (Instance Name)","lvl2":"Resources"},"type":"lvl2","url":"/docs/implementations/implementation-first/implementation-first#resources","position":4},{"hierarchy":{"lvl1":"Instance (Instance Name)","lvl2":"Resources"},"content":"Bill of Materials\n\nDownload BOM\n\nLab-Ready Protocol\n\nDownload Protocol\n\nPlatemap Template\n\nDownload Platemap","type":"content","url":"/docs/implementations/implementation-first/implementation-first#resources","position":5},{"hierarchy":{"lvl1":"Instance (Instance Name)","lvl2":"Expected Behavior"},"type":"lvl2","url":"/docs/implementations/implementation-first/implementation-first#expected-behavior","position":6},{"hierarchy":{"lvl1":"Instance (Instance Name)","lvl2":"Expected Behavior"},"content":"The transcription factors moved to their promoter sites. They did this quietly, without ceremony. RNA polymerase followed. It always did. In the mitochondria, the cristae worked. They made ATP the way they had always made it. Through gradients. Through chemistry older than thought. The ribosomes assembled. They read the RNA like fishermen reading water. Each amino acid found its place. The chain grew longer. Vesicles carried their cargo through the cell’s narrow passages. From the rough ER to the Golgi. Some proteins were marked. Others were not. The cell knew which ones mattered. The checkpoints watched over replication. DNA split and reformed. When something went wrong, the cell stopped. It had learned this lesson before.\n\n\n\nTranslation kinetics of PURE reactions using the custom energy solution with or without CP. The “PURE Positive” refers to the PURExpress reaction using Solutions A and B. Data sourced from \n\nDevNote.\n\n\n\nFinal protein yields of the three reactions measured at steady state. \n\nDevNote.","type":"content","url":"/docs/implementations/implementation-first/implementation-first#expected-behavior","position":7},{"hierarchy":{"lvl1":"Instance (Instance Name)","lvl2":"Modules"},"type":"lvl2","url":"/docs/implementations/implementation-first/implementation-first#modules","position":8},{"hierarchy":{"lvl1":"Instance (Instance Name)","lvl2":"Modules"},"content":"This instance made use of the following modules.\n\nplamGFP\n\nmy-module","type":"content","url":"/docs/implementations/implementation-first/implementation-first#modules","position":9},{"hierarchy":{"lvl1":"Instance (Instance Name)"},"type":"lvl1","url":"/docs/implementations/implementation-template/implementation-template","position":0},{"hierarchy":{"lvl1":"Instance (Instance Name)"},"content":"","type":"content","url":"/docs/implementations/implementation-template/implementation-template","position":1},{"hierarchy":{"lvl1":"Instance (Instance Name)","lvl2":"Overview"},"type":"lvl2","url":"/docs/implementations/implementation-template/implementation-template#overview","position":2},{"hierarchy":{"lvl1":"Instance (Instance Name)","lvl2":"Overview"},"content":"Transcription factor modules bind to regulatory sequences upstream of coding regions, initiating RNA polymerase recruitment modules and gene expression cascades. Mitochondrial cristae modules facilitate oxidative phosphorylation through electron transport chain complexes, generating ATP via chemiosmotic gradient modules. Ribosomal subunit modules assemble on messenger RNA templates, catalyzing peptide bond formation between amino acids during translation elongation modules. Membrane-bound vesicle modules transport cargo proteins through endoplasmic reticulum and Golgi apparatus modules, undergoing post-translational modification modules including glycosylation and phosphorylation. Cell cycle checkpoint modules monitor DNA replication fidelity and chromosome segregation modules, preventing genomic instability through tumor suppressor pathway modules. Enzymatic cascade modules regulate metabolic flux through glycolysis and citric acid cycle modules, coordinating cellular energy production with biosynthetic demand modules.\n\n\n\nThis is a schematic of the module of the system.","type":"content","url":"/docs/implementations/implementation-template/implementation-template#overview","position":3},{"hierarchy":{"lvl1":"Instance (Instance Name)","lvl2":"Resources"},"type":"lvl2","url":"/docs/implementations/implementation-template/implementation-template#resources","position":4},{"hierarchy":{"lvl1":"Instance (Instance Name)","lvl2":"Resources"},"content":"Bill of Materials\n\nDownload BOM\n\nLab-Ready Protocol\n\nDownload Protocol\n\nPlatemap Template\n\nDownload Platemap","type":"content","url":"/docs/implementations/implementation-template/implementation-template#resources","position":5},{"hierarchy":{"lvl1":"Instance (Instance Name)","lvl2":"Expected Behavior"},"type":"lvl2","url":"/docs/implementations/implementation-template/implementation-template#expected-behavior","position":6},{"hierarchy":{"lvl1":"Instance (Instance Name)","lvl2":"Expected Behavior"},"content":"The transcription factors moved to their promoter sites. They did this quietly, without ceremony. RNA polymerase followed. It always did. In the mitochondria, the cristae worked. They made ATP the way they had always made it. Through gradients. Through chemistry older than thought. The ribosomes assembled. They read the RNA like fishermen reading water. Each amino acid found its place. The chain grew longer. Vesicles carried their cargo through the cell’s narrow passages. From the rough ER to the Golgi. Some proteins were marked. Others were not. The cell knew which ones mattered. The checkpoints watched over replication. DNA split and reformed. When something went wrong, the cell stopped. It had learned this lesson before.\n\n\n\nTranslation kinetics of PURE reactions using the custom energy solution with or without CP. The “PURE Positive” refers to the PURExpress reaction using Solutions A and B. Data sourced from \n\nDevNote.\n\n\n\nFinal protein yields of the three reactions measured at steady state. \n\nDevNote.","type":"content","url":"/docs/implementations/implementation-template/implementation-template#expected-behavior","position":7},{"hierarchy":{"lvl1":"Instance (Instance Name)","lvl2":"Modules"},"type":"lvl2","url":"/docs/implementations/implementation-template/implementation-template#modules","position":8},{"hierarchy":{"lvl1":"Instance (Instance Name)","lvl2":"Modules"},"content":"This instance made use of the following modules.\n\nplamGFP\n\nmy-module","type":"content","url":"/docs/implementations/implementation-template/implementation-template#modules","position":9},{"hierarchy":{"lvl1":"Implementations"},"type":"lvl1","url":"/docs/implementations/implementations-main","position":0},{"hierarchy":{"lvl1":"Implementations"},"content":"","type":"content","url":"/docs/implementations/implementations-main","position":1},{"hierarchy":{"lvl1":"Implementations","lvl2":"Overview"},"type":"lvl2","url":"/docs/implementations/implementations-main#overview","position":2},{"hierarchy":{"lvl1":"Implementations","lvl2":"Overview"},"content":"Implementations are examples of combinations of useful Processes and Modules. Each implementation will contain the following information:\n\nContents of an implementation\n\nBrief description\n\nLab-ready protocol\n\nBill of materials\n\nList of what to have at your bench\n\nPerformance data\n\nfor cytosols this requirement might be upgraded to include a “discovery plate sweep”\n\nfor cells this requirement might be upgraded to include an “environment plate sweep” - like a discovery plate but for outer solutions.\n\nList of supporting DevNotes\n\nList of modules and processes used\n\nImplementations typically progress from cytosol-level to cell-level functionality. Consequently, a specific capacity may initially be deployed as a cytosol-level implementation before being upgraded to cell-level. When this upgrade occurs, the cell-level implementation builds upon the cytosol-level version.","type":"content","url":"/docs/implementations/implementations-main#overview","position":3},{"hierarchy":{"lvl1":"Implementations","lvl3":"Cytosols","lvl2":"Overview"},"type":"lvl3","url":"/docs/implementations/implementations-main#cytosols","position":4},{"hierarchy":{"lvl1":"Implementations","lvl3":"Cytosols","lvl2":"Overview"},"content":"Implementation Template\n\nImplementation First\n\nplamGFP\n\nMTHFS","type":"content","url":"/docs/implementations/implementations-main#cytosols","position":5},{"hierarchy":{"lvl1":"Implementations","lvl3":"Cells","lvl2":"Overview"},"type":"lvl3","url":"/docs/implementations/implementations-main#cells","position":6},{"hierarchy":{"lvl1":"Implementations","lvl3":"Cells","lvl2":"Overview"},"content":"plamGFP\n\nDetector Cell\n\nEmitter Cell\n\nResponder Cell\n\nPPK Cell\n\nPPK + ClpXP Cell\n\nSecYEG Cell\n\nPPK + SecYEG Cell\n\nPPK + ClpXP + SecYEG Cell = DevCell (v1.0)","type":"content","url":"/docs/implementations/implementations-main#cells","position":7},{"hierarchy":{"lvl1":"Implementations","lvl3":"Assemblies","lvl2":"Overview"},"type":"lvl3","url":"/docs/implementations/implementations-main#assemblies","position":8},{"hierarchy":{"lvl1":"Implementations","lvl3":"Assemblies","lvl2":"Overview"},"content":"","type":"content","url":"/docs/implementations/implementations-main#assemblies","position":9},{"hierarchy":{"lvl1":"Specification: plamGFP"},"type":"lvl1","url":"/docs/modules/module-plamgfp/specification-module-plamgfp","position":0},{"hierarchy":{"lvl1":"Specification: plamGFP"},"content":"","type":"content","url":"/docs/modules/module-plamgfp/specification-module-plamgfp","position":1},{"hierarchy":{"lvl1":"Specification: plamGFP","lvl2":"Overview"},"type":"lvl2","url":"/docs/modules/module-plamgfp/specification-module-plamgfp#overview","position":2},{"hierarchy":{"lvl1":"Specification: plamGFP","lvl2":"Overview"},"content":"Mitochondria consectetur adipiscing phylum, sed do ribosomes tempor incididunt ut chlorophyll et dolore magna cytoplasm. Ut enim ad minim chromosome, quis nostrud photosynthesis ullamco laboris nisi ut enzyme aliquip ex ea commodo peptide. Duis aute nucleotide in reprehenderit in voluptate vesicle esse cillum genome fugiat nulla pariatur.","type":"content","url":"/docs/modules/module-plamgfp/specification-module-plamgfp#overview","position":3},{"hierarchy":{"lvl1":"Specification: plamGFP","lvl3":"Schematic","lvl2":"Overview"},"type":"lvl3","url":"/docs/modules/module-plamgfp/specification-module-plamgfp#schematic","position":4},{"hierarchy":{"lvl1":"Specification: plamGFP","lvl3":"Schematic","lvl2":"Overview"},"content":"TODO\n\nWhat are good guidelines for a schematic representations of different modules? For a protein output I think it might be useful to include a table of properties, there properties might correspond to parameters that we would put into the CDK can start with molecular weight and isoelectric point for proteins, small molecules might include MW, membrane permeability? Although some of this might be split into a particular instance as well - particularly if it involves interaction with membrane...\n\n\n\nThis is a schematic of the module.","type":"content","url":"/docs/modules/module-plamgfp/specification-module-plamgfp#schematic","position":5},{"hierarchy":{"lvl1":"Specification: plamGFP","lvl3":"Designs","lvl2":"Overview"},"type":"lvl3","url":"/docs/modules/module-plamgfp/specification-module-plamgfp#designs","position":6},{"hierarchy":{"lvl1":"Specification: plamGFP","lvl3":"Designs","lvl2":"Overview"},"content":"TODO\n\nWhat should belong in this table? It feels like this should actually just be one thing...\n\nName\n\nLength (bp)\n\nFile\n\npOpen-pT7-plamGFP-PURE\n\n2946\n\ndesign\n\npOpen-??-plamGFP-TXTL\n\n2958\n\ndesign\n\npOpen-??-plamGFP-Chimeric\n\n2958\n\ndesign","type":"content","url":"/docs/modules/module-plamgfp/specification-module-plamgfp#designs","position":7},{"hierarchy":{"lvl1":"Specification: plamGFP","lvl3":"Compatible processes","lvl2":"Overview"},"type":"lvl3","url":"/docs/modules/module-plamgfp/specification-module-plamgfp#compatible-processes","position":8},{"hierarchy":{"lvl1":"Specification: plamGFP","lvl3":"Compatible processes","lvl2":"Overview"},"content":"TODO\n\nFor GFP the distinction between process and instances feels overwrought or at least hard to distinguish\n\nb.next PURE\n\nOnePot PURE\n\n36Pot PURE\n\nFormulation. This module can be implemented in [my-process] by implementing the following formulation in the base process. TODO: can I reference a table from another page?\n\n(this-tbl-36pot-formulation)=:::{table}\n:name: spec00:tbl-36pot-formulation\n\nComponent\n\nExperiment (uL)\n\nNEB Sol B -Ribos\n\n\n\nWorkshop Protein Mix( ___ ug/uL)\n\n3\n\nNEB Ribosomes\n\n4.5\n\nNEB Sol A\n\n10\n\nNEB Sol B\n\n\n\nRNse Inhibitor\n\n1.25\n\npT7-plamGFP plasmid (120 ng/uL)\n\n1.25\n\nUltrapure water\n\n5\n\nTotal\n\n25\n**Process** The following steps should be REMOVED, ADDED, or MODIFIED to implement the Module in the Process. \n\n- ADD. Preparation of PPK stock solution [Reference-instance??]\n\nSimple Cell","type":"content","url":"/docs/modules/module-plamgfp/specification-module-plamgfp#compatible-processes","position":9},{"hierarchy":{"lvl1":"Specification: plamGFP","lvl3":"Usage","lvl2":"Overview"},"type":"lvl3","url":"/docs/modules/module-plamgfp/specification-module-plamgfp#usage","position":10},{"hierarchy":{"lvl1":"Specification: plamGFP","lvl3":"Usage","lvl2":"Overview"},"content":"Collections\n\nTODO\n\nAt least for GFP this approach seems like it will blow up fairly quickly...\nAlso in this category I think we would treat b.next PURE and 36Pot PURE as interchangeable\nWe should also have a Articles that explain some of our reasoning behind certain design choices, for example why we regard 36Pot and OnePot as being distinguishable.\n\nInstance of plamGFP in b.next PURE\n\nInstance of plamGFP in OnePot PURE\n\nInstance of plamGFP in 36Pot PURE\n\nInstance of plamGFP in b.next PURE + PPK\n\nInstance of plamGFP in OnePot PURE + PPK\n\nInstance of plamGFP in 36Pot PURE + PPK\n\nInstance of plamGFP in Simple Cell\n\nInstance of plamGFP in Simple Cell + PPK Cell\n\nDevNotes\n\nDevNote-3\n\nLiterature\n\nWang et al. 2019\n\nTODO\n\nI want to figure out how to hide the list of references from being auto generated at the bottom.","type":"content","url":"/docs/modules/module-plamgfp/specification-module-plamgfp#usage","position":11},{"hierarchy":{"lvl1":"Module Specification (Module Name)"},"type":"lvl1","url":"/docs/modules/module-template/specification-module-template","position":0},{"hierarchy":{"lvl1":"Module Specification (Module Name)"},"content":"","type":"content","url":"/docs/modules/module-template/specification-module-template","position":1},{"hierarchy":{"lvl1":"Module Specification (Module Name)","lvl2":"Overview"},"type":"lvl2","url":"/docs/modules/module-template/specification-module-template#overview","position":2},{"hierarchy":{"lvl1":"Module Specification (Module Name)","lvl2":"Overview"},"content":"Mitochondria consectetur adipiscing phylum, sed do ribosomes tempor incididunt ut chlorophyll et dolore magna cytoplasm. Ut enim ad minim chromosome, quis nostrud photosynthesis ullamco laboris nisi ut enzyme aliquip ex ea commodo peptide. Duis aute nucleotide in reprehenderit in voluptate vesicle esse cillum genome fugiat nulla pariatur.","type":"content","url":"/docs/modules/module-template/specification-module-template#overview","position":3},{"hierarchy":{"lvl1":"Module Specification (Module Name)","lvl3":"Schematic","lvl2":"Overview"},"type":"lvl3","url":"/docs/modules/module-template/specification-module-template#schematic","position":4},{"hierarchy":{"lvl1":"Module Specification (Module Name)","lvl3":"Schematic","lvl2":"Overview"},"content":"TODO\n\nWhat are good guidelines for a schematic representations of different modules?\n\n\n\nThis is a schematic of the module.","type":"content","url":"/docs/modules/module-template/specification-module-template#schematic","position":5},{"hierarchy":{"lvl1":"Module Specification (Module Name)","lvl3":"Designs","lvl2":"Overview"},"type":"lvl3","url":"/docs/modules/module-template/specification-module-template#designs","position":6},{"hierarchy":{"lvl1":"Module Specification (Module Name)","lvl3":"Designs","lvl2":"Overview"},"content":"TODO\n\nWhat should belong in this table?\n\nName\n\nLength (bp)\n\nFile\n\npOpen-pT7-ClpP-CHis\n\n2500\n\npath​-to​-design​-01​.gb\n\npOpen-pT7-ClpX-linker-CHis\n\n1699\n\npath​-to​-design​-01​.gb\n\npET28a-ClpP-CHis\n\n3145\n\npath​-to​-design​-01​.gb","type":"content","url":"/docs/modules/module-template/specification-module-template#designs","position":7},{"hierarchy":{"lvl1":"Module Specification (Module Name)","lvl3":"Compatible processes","lvl2":"Overview"},"type":"lvl3","url":"/docs/modules/module-template/specification-module-template#compatible-processes","position":8},{"hierarchy":{"lvl1":"Module Specification (Module Name)","lvl3":"Compatible processes","lvl2":"Overview"},"content":"My reference table (this is on same page): \n\nTable\nMy reference table (this is on different page): \n\nref\n\nTODO\n\nFor GFP the distinction between process and instances feels overwrought or at least hard to distinguish\n\nb.next PURE\n\nOnePot PURE\n\n36Pot PURE\n\nFormulation. This module can be implemented in [my-process] by implementing the following formulation in the base process. TODO: can I reference a table from another page? \n\nmy rerefence\n\nComponent\n\nExperiment (uL)\n\nNEB Sol B -Ribos\n\n\n\nWorkshop Protein Mix( ___ ug/uL)\n\n3\n\nNEB Ribosomes\n\n4.5\n\nNEB Sol A\n\n10\n\nNEB Sol B\n\n\n\nRNse Inhibitor\n\n1.25\n\npT7-my-custom-plasmid (120 ng/uL)\n\n1.25\n\nUltrapure water\n\n5\n\nTotal\n\n25\n\nProcess The following steps should be REMOVED, ADDED, or MODIFIED to implement the Module in the Process.\n\nADD. Preparation of PPK stock solution","type":"content","url":"/docs/modules/module-template/specification-module-template#compatible-processes","position":9},{"hierarchy":{"lvl1":"Module Specification (Module Name)","lvl3":"Usage","lvl2":"Overview"},"type":"lvl3","url":"/docs/modules/module-template/specification-module-template#usage","position":10},{"hierarchy":{"lvl1":"Module Specification (Module Name)","lvl3":"Usage","lvl2":"Overview"},"content":"Collections\n\nCollection-1\n\nDevNotes\n\nDevNote-3\n\nLiterature\n\nWang et al. 2019\n\nTODO\n\nI want to figure out how to hide the list of references from being auto generated at the bottom.","type":"content","url":"/docs/modules/module-template/specification-module-template#usage","position":11},{"hierarchy":{"lvl1":"Modules"},"type":"lvl1","url":"/docs/modules/modules-main","position":0},{"hierarchy":{"lvl1":"Modules"},"content":"","type":"content","url":"/docs/modules/modules-main","position":1},{"hierarchy":{"lvl1":"Modules","lvl2":"Overview"},"type":"lvl2","url":"/docs/modules/modules-main#overview","position":2},{"hierarchy":{"lvl1":"Modules","lvl2":"Overview"},"content":"A Module is a useful biochemical formulation, often incorporating a genetically encoded component, that performs a particular function. Modules Specifications contains the following information:\n\nbrief description\n\nWhere to access the materials\n\ndesign file of genetic components, if applicable\n\nschematic describing basic use\n\nList of reference implementations","type":"content","url":"/docs/modules/modules-main#overview","position":3},{"hierarchy":{"lvl1":"Modules","lvl3":"Module contribution standards","lvl2":"Overview"},"type":"lvl3","url":"/docs/modules/modules-main#module-contribution-standards","position":4},{"hierarchy":{"lvl1":"Modules","lvl3":"Module contribution standards","lvl2":"Overview"},"content":"Cytosol Module Standard","type":"content","url":"/docs/modules/modules-main#module-contribution-standards","position":5},{"hierarchy":{"lvl1":"Modules","lvl3":"Modules validated in cytosols","lvl2":"Overview"},"type":"lvl3","url":"/docs/modules/modules-main#modules-validated-in-cytosols","position":6},{"hierarchy":{"lvl1":"Modules","lvl3":"Modules validated in cytosols","lvl2":"Overview"},"content":" - [Module Template](https://antonrmolina.github.io/nucleus-distribution-pages/docs/modules/module-template/specification-module-template) \n\nModule Template\n\nControl: ClpXP","type":"content","url":"/docs/modules/modules-main#modules-validated-in-cytosols","position":7},{"hierarchy":{"lvl1":"Modules","lvl3":"Modules validated in cells","lvl2":"Overview"},"type":"lvl3","url":"/docs/modules/modules-main#modules-validated-in-cells","position":8},{"hierarchy":{"lvl1":"Modules","lvl3":"Modules validated in cells","lvl2":"Overview"},"content":" - [Reporter: plamGFP](https://antonrmolina.github.io/nucleus-distribution-pages/docs/modules/module-plamgfp/specification-module-plamgfp) \n\nReporter: plamGFP\n\nReporter: deGFP\n\nReporter: mScarlett\n\nDetector: aTc\n\nEmitter: IVHSL\n\nEnergy: PPK2\n\nMembrane: POPC\n\nMembrane: POPC/Chol\n\nMembrane: EggPC\n\nTransporter: aHL\n\nTransporter: Cx43\n\nChaperone: SecYEG","type":"content","url":"/docs/modules/modules-main#modules-validated-in-cells","position":9},{"hierarchy":{"lvl1":"Make Amino Acid Mix"},"type":"lvl1","url":"/docs/processes/make-amino-acid-mix/process-make-amino-acid-mix","position":0},{"hierarchy":{"lvl1":"Make Amino Acid Mix"},"content":"","type":"content","url":"/docs/processes/make-amino-acid-mix/process-make-amino-acid-mix","position":1},{"hierarchy":{"lvl1":"Make Amino Acid Mix","lvl2":"Overview"},"type":"lvl2","url":"/docs/processes/make-amino-acid-mix/process-make-amino-acid-mix#overview","position":2},{"hierarchy":{"lvl1":"Make Amino Acid Mix","lvl2":"Overview"},"content":"Amino Acid Mix is an equimolar (3.25 mM) master mix of the 20 canonical amino acids. Here, we make stock solutions for each amino acid and assemble them into Amino Acid Mix for use in downstream protocols.\n\nImportant Information\n\nPlease read this section carefully. It contains important notes, resources, and safety information. Not all information included here is included in the lab-ready protocol.\n\nNotes\n\nTODO\n\nResources\n\nTODO: Lab-ready Protocol\n\ndownload\n\nAssembly Worksheet\n\ndownload\n\nTODO: Bill of Materials\n\ndownload\n\nComposition\n\nComposition of Amino Acid Mix\n\nTODO\n\n | **Reagent** | **Concentration in Energy Mix (mM)** | **Concentration in Final Reaction (mM)** | \n\nPrerequisite Documentation\n\nNone\n\nCritical Materials\n\nReagent\n\nProduct Name\n\nManufacturer\n\nPart #\n\nPrice\n\nStorage Conditions\n\nLink\n\nAmino Acids\n\nL-Amino acids, analytical standard\n\nSigma-Aldrich\n\nLAA21-1KT\n\n$558\n\n1C to 4C\n\n[\n\nlink]\n\nLow Bind Protein Tubes\n\nX\n\nX\n\nX\n\nX\n\nX\n\nX\n\nGenetically Encoded Components\n\nNone\n\nHazardous Materials\n\nNone\n\nReferences\n\nNone","type":"content","url":"/docs/processes/make-amino-acid-mix/process-make-amino-acid-mix#overview","position":3},{"hierarchy":{"lvl1":"Make Amino Acid Mix","lvl2":"Protocol"},"type":"lvl2","url":"/docs/processes/make-amino-acid-mix/process-make-amino-acid-mix#protocol","position":4},{"hierarchy":{"lvl1":"Make Amino Acid Mix","lvl2":"Protocol"},"content":" **Prepare Amino Acid Stock Solutions.** ","type":"content","url":"/docs/processes/make-amino-acid-mix/process-make-amino-acid-mix#protocol","position":5},{"hierarchy":{"lvl1":"Make Amino Acid Mix","lvl3":"Prepare Amino Acid Stock Solutions.","lvl2":"Protocol"},"type":"lvl3","url":"/docs/processes/make-amino-acid-mix/process-make-amino-acid-mix#prepare-amino-acid-stock-solutions","position":6},{"hierarchy":{"lvl1":"Make Amino Acid Mix","lvl3":"Prepare Amino Acid Stock Solutions.","lvl2":"Protocol"},"content":"Use the included Amino Acid Mix worksheet included as a resource for this protocol to determine the minimum mass you will need for each amino acid given how much amino acid mix you want to make\n\nWeigh Tyr into the cap of a 15 mL conical tube. Note mass and recalculate AA mix volume based on required volume to bring Tyr to 3.25 mM\n\nLabel 19x low bind protein tubes for each amino acid stock other than Tyr\n\nWeigh each amino acid and note mass.\n\nNOTE: use static gun to remove static from each tube if needed\n\n weigh mass.\n\nNOTE: make sure mass stabilizes before recording\n\n check if resuspension volume will fit assigned tube. else, adjust mass\n\n Filter ultrapure water with 0.22 um and add resuspension volume of filtered ultrapure water to each tube\n\n resuspend 19x amino acid stocks (excluding Tyr)\n\n microfuge tubes on heater shaker set to 65C / 1400 rpm\n\n note incubation start time:\n\n check for complete resuspension every 30 min (should take ≤ 1 hr) **Assemble Amino Acid Master Mix.** ","type":"content","url":"/docs/processes/make-amino-acid-mix/process-make-amino-acid-mix#prepare-amino-acid-stock-solutions","position":7},{"hierarchy":{"lvl1":"Make Amino Acid Mix","lvl3":"Assemble Amino Acid Master Mix.","lvl2":"Protocol"},"type":"lvl3","url":"/docs/processes/make-amino-acid-mix/process-make-amino-acid-mix#assemble-amino-acid-master-mix","position":8},{"hierarchy":{"lvl1":"Make Amino Acid Mix","lvl3":"Assemble Amino Acid Master Mix.","lvl2":"Protocol"},"content":" Put Tyr 15 mL tubes in hot water bath sonicator set to 65C. Keep other 19x amino acid stocks on heater shaker at 65C.\n\n For each amino acid stock other than Tyr, add the calculated volume to Tyr 15 mL tube. Keep the Tyr tube in 65C sonicator bath to maintain temperature and speed up resuspension.\n\n Add filtered ultrapure water to final concentration as specified\n\n Resuspend amino acid mix in hot water bath sonicator set to 65C with sonication\n\n Note incubation start time:\n\n Check for complete resuspension every 30 min (should take ~ 30 min)\n\n Syringe filter using 0.22 um filter **Storage.** ","type":"content","url":"/docs/processes/make-amino-acid-mix/process-make-amino-acid-mix#assemble-amino-acid-master-mix","position":9},{"hierarchy":{"lvl1":"Make Amino Acid Mix","lvl3":"Storage","lvl2":"Protocol"},"type":"lvl3","url":"/docs/processes/make-amino-acid-mix/process-make-amino-acid-mix#storage","position":10},{"hierarchy":{"lvl1":"Make Amino Acid Mix","lvl3":"Storage","lvl2":"Protocol"},"content":" Aliquot and store at -20C","type":"content","url":"/docs/processes/make-amino-acid-mix/process-make-amino-acid-mix#storage","position":11},{"hierarchy":{"lvl1":"Make Ribosomes"},"type":"lvl1","url":"/docs/processes/make-ribosomes/process-make-ribosomes","position":0},{"hierarchy":{"lvl1":"Make Ribosomes"},"content":"","type":"content","url":"/docs/processes/make-ribosomes/process-make-ribosomes","position":1},{"hierarchy":{"lvl1":"Make Ribosomes","lvl2":"Overview"},"type":"lvl2","url":"/docs/processes/make-ribosomes/process-make-ribosomes#overview","position":2},{"hierarchy":{"lvl1":"Make Ribosomes","lvl2":"Overview"},"content":"Ribosomes are large complexes of RNA and proteins (MW ~2.7 MDa) that are the sites of protein synthesis. Ribosomes coordinate the decoding of mRNA transcripts by tRNA and catalyze the formation of each peptide bond in new proteins, making ribosomes a key component of any protein synthesis system. Ribosomes can be purified from E. coli biomass by a variety of methods (e.g., His-tagged ribosomes can be purified by Ni-His chromatography), but we recommend a two step process: (1) initial, tag-free purification by hydrophobic interaction chromatography (HIC) and (2) size-selective precipitation by ultracentrifugation. This protocol will show you how to grow E. coli A19 biomass and purify ribosomes by HIC followed by ultracentrifugation.\n\nImportant Information\n\nPlease read this section carefully. It contains important notes, resources, and safety information. Not all information included here is included in the lab-ready protocol.\n\nNotes\n\nWe purify RNAs and Riboproteins from E. coli A19 biomass (\n\nCGSC 5997), a strain with a mutation in RNase I that improves RNA yields. You can use other RNase deficient strains with this protocol, but you may need to optimize this protocol to achieve high yield and purity.\n\n‼️All reagents and materials must be prepared RNase-free. Use RNaseZap or 10% bleach to decontaminate plastic and glassware and rinse with nuclease-free water. We find ultrapure water (18.2 MOhm) is often sufficient for RNase-free work.\n\nResources\n\nTODO: Lab-ready Protocol\n\ndownload\n\nAssembly Worksheet\n\ndownload\n\nTODO: Bill of Materials\n\ndownload\n\nComposition\n\nComposition of Ribosomes\n\nTODO\n\n | **Reagent** | **Concentration in Energy Mix (mM)** | **Concentration in Final Reaction (mM)** | \n\nPrerequesite Documentation\n\nNone\n\nCritical Materials\n\nTODO\n\nGenetically Encoded Components\n\nNone\n\nHazardous Materials\n\nNone","type":"content","url":"/docs/processes/make-ribosomes/process-make-ribosomes#overview","position":3},{"hierarchy":{"lvl1":"Make Ribosomes","lvl2":"Protocol"},"type":"lvl2","url":"/docs/processes/make-ribosomes/process-make-ribosomes#protocol","position":4},{"hierarchy":{"lvl1":"Make Ribosomes","lvl2":"Protocol"},"content":"","type":"content","url":"/docs/processes/make-ribosomes/process-make-ribosomes#protocol","position":5},{"hierarchy":{"lvl1":"Make Ribosomes","lvl3":"Cell culture","lvl2":"Protocol"},"type":"lvl3","url":"/docs/processes/make-ribosomes/process-make-ribosomes#cell-culture","position":6},{"hierarchy":{"lvl1":"Make Ribosomes","lvl3":"Cell culture","lvl2":"Protocol"},"content":"Note: you can work from glycerol stocks OR colonies.\n\nWe first need to prepare bacterial cultures. We will work from 6 mL overnight cultures of our expression strains and backdilute them the next day. In order to prepare these overnight cultures, we need stocks of bacteria.\n\nWe worked from 100 uL aliquots of our glycerol stocks, frozen in PCR strip tubes. When seeding our overnights with bacteria, we poked one glycerol aliquot with a pipette tip and ejected the tip into culture tubes (more details below).\n\nOptionally, you can work from individual colonies by streaking out your bacterial stocks. Working from colonies assures that your bulk outgrowth will have come from a single colony forming unit.\n\nPrepare overnight cultures.\n\nAdd 5 mL Luria Broth (LB) under sterile conditions to two (2) 14 mL culture tubes.\n\nLabel one tube “(+)”. Add 10 uL of A19 glycerol stock to (+).\n\nLabel the other tube “(-)”. This will be your negative control, testing if your technique is sterile.\n\nIncubate both tubes overnight shaking at 37C / (225-250) rpm / (12-16) hr.\n\nPerform bulk outgrowth.\n\n Check if (-) has growth. If not, continue.\n\n Back dilute overnight 1:250 - 1:1000 into 4x 450 mL fresh LB in 2 L baffled Erlenmeyer flasks (e.g., 1.8 mL overnight into 450 mL LB).\n\n Incubate back diluted cultures at 37C / (225-250) rpm to mid-log phase (OD600 between 0.6 and 0.8, typically ~3 hrs).\n\nPellet, wash, and store cells.\n\n Fill 1 L centrifuge bottles with culture. Balance centrifuge bottles against each other and centrifuge cultures at 16 000 rcf / 4C / 10 min.\n\n Decant supernatant, add fresh culture, and repeat centrifugation as above, working through the remaining culture. You should end up with large pellets at the bottom of each centrifuge bottle.\n\n Wash the pellets by resuspending (4C) NaCl (0.9%) in about 50 mL and transfer the resuspended cells to a single centrifuge bottle. Dilute to ~500 mL and re-pellet at 16 000 rcf / 4C / 10 min.\n\n Transfer pellets by spatula into a tared bag weigh and record the mass.\n\n Flash freeze pellet in liquid nitrogen and store at -80C.","type":"content","url":"/docs/processes/make-ribosomes/process-make-ribosomes#cell-culture","position":7},{"hierarchy":{"lvl1":"Make Ribosomes","lvl3":"Lysis","lvl2":"Protocol"},"type":"lvl3","url":"/docs/processes/make-ribosomes/process-make-ribosomes#lysis","position":8},{"hierarchy":{"lvl1":"Make Ribosomes","lvl3":"Lysis","lvl2":"Protocol"},"content":" Resuspend (2-5) g cell pellet in 25 mL of Ribosome Lysis buffer & lyse cells using 130-watt probe sonicator (probe tip diameter: 6 mm) on ice with following parameters: 50% amplitude, 15s on/ 30s off for 2 minutes on-time. The amount of energy delivered via sonication will vary depending on the amount of cells resuspended.\n\n Clarify lysate by centrifugation at 16 000 rcf / 4C / 10 min.\n\n Aspirate supernatant and measure volume. Add an equal volume of Salting Out buffer to adjust the concentration of ammonium sulfate to 1.5 M and mix well. Incubate at 4C / 10 min.\n\n Remove precipitate by centrifugation at 16 000 rcf / 4C / 10 min.\n\n Filter supernatant using a 0.22 um syringe filter and keep cold (4C).","type":"content","url":"/docs/processes/make-ribosomes/process-make-ribosomes#lysis","position":9},{"hierarchy":{"lvl1":"Make Ribosomes","lvl3":"FPLC purification","lvl2":"Protocol"},"type":"lvl3","url":"/docs/processes/make-ribosomes/process-make-ribosomes#fplc-purification","position":10},{"hierarchy":{"lvl1":"Make Ribosomes","lvl3":"FPLC purification","lvl2":"Protocol"},"content":"Note: line configuration on FPLC.\n\nLine\n\nBuffer\n\nA11\n\nRibosome Wash Buffer\n\nB1\n\nRibosome Elution Buffer\n\nA12\n\nWater\n\nA13\n\n0.5 M NaOH\n\nA14\n\n0.1 M Acetic Acid\n\nSet-up.\n\n Connect the two Butyl column (5 mL) in tandem, totaling a column volume (CV) of 10 mL.\n\n Place A1 in Ribosome Wash Buffer and B1 in Ribosome Elution Buffer. Place sample line in A2. Set the default flow rate to 4 mL / min (except for pump washes: 10 mL/min).\n\nEquilibrate HIC column.\n\n Perform a pump wash with Ribosome Wash Buffer (without TCEP) and equilibrate the column with 4 CV of Ribosome Wash Buffer(without TCEP).\n\n Once you’ve equilibrated your columns, add TCEP to Ribosome Wash and Elution Buffer.\n\n Load your fraction collector with 15 mL conical tubes and set the fraction volume to 5 mL.\n\n If using a sample pump to load samples, place sample line (S1) into sample and load around 90% of sample volume onto the column. Once almost loaded, dilute the sample with Ribosome wash buffer (~5 mL) to load as much sample as possible. DO NOT allow air into the FPLC; make sure the sample line is always submerged.\n\nPerform HIC\n\n Wash step 1: wash with 3 CV of Ribosome Wash Buffer to remove unbound components .\n\n Wash step 2: wash with 5 CV of 80% Wash Buffer and 20% Ribosome Elution Buffer.\n\n Elution: elute the product by applying 3.5 CV (35 mL) of 50% Ribosome Wash Buffer and 50% Ribosome Elution Buffer. Ensure that the fraction collector captures these fractions separately.\n\n Wash step 3: Elute all strongly interacting contaminants with 5 CV of 100% Ribosome Elution Buffer.\n\nClean columns\n\n Place inlet into a NaOH (0.5 M) and perform pump wash. Wash the column with 3 CV NaOH (0.5M).\n\n Place the inlet into water, perform pump wash, and then was column in 2 CV filtered Ultrapure water.\n\n Place the inlet into AcOH (0.1 M), perform pump wash, and subsequently wash column with 3 CV AcOH (0.1 M).\n\n Pump wash with water and wash column with 2 CV filtered MilliQ water.\n\n Place all inlets into EtOH (20% v/v). Perform a pump wash, then wash columns with 3 CV EtOH (20% v/v). Store columns at 4C in EtOH (20% v/v) until ready for use.","type":"content","url":"/docs/processes/make-ribosomes/process-make-ribosomes#fplc-purification","position":11},{"hierarchy":{"lvl1":"Make Ribosomes","lvl3":"Ultracentrifugation","lvl2":"Protocol"},"type":"lvl3","url":"/docs/processes/make-ribosomes/process-make-ribosomes#ultracentrifugation","position":12},{"hierarchy":{"lvl1":"Make Ribosomes","lvl3":"Ultracentrifugation","lvl2":"Protocol"},"content":" Gently overlay recovered fractions (should correspond to second peak) onto 35 mL of Cushion Buffer in a polycarbonate ultracentrifuge bottle (70 mL).\n\n Prepare another polycarbonate ultracentrifuge bottle as a balance. Measure 35 mL of Cushion Buffer, then add Ribosome Buffer until the balance mass is within 0.1 g of the sample bottle mass. Make sure all bottles are well balanced (Δm ≤ 0.1 g) and have no cracks!\n\n Pellet ribosomes by ultracentrifugation at 100 000 rcf / 4C / 16 hrs. A translucent ribosome pellet will be formed at the bottom of the centrifuge bottle. It may be difficult to see.\n\n Discard the supernatant. Carefully, wash each pellet with 0.5 mL cold ribosome buffer. Repeat this step twice.\n\nNote: Don’t disturb the ribosome pellet during washing.\n\nThe ribosome pellet is fairly compact and stable, but some ribosomes can get resuspended during washing and be lost in the process. Be careful!\n\nFirst, find the pellet. Next, wash the pellet by gently pipetting Ribosome Buffer down the sides of the tube, allowing the buffer to run over the pellet. Tilt the ultracentrifuge bottle gently so that the buffer falls away from the pellet, aspirate the buffer, add fresh buffer as before, and repeat.\n\n Resuspend the clear pellets in 100 uL of Ribosome Buffer on ice using a magnetic stir bar (3 mm diameter, 10 mm length) on a magnetic stirrer set at the lowest possible speed. Collect resuspended ribosomes.\n\n Wash tubes with an additional 50 uL of Ribosome Buffer to resuspend any remaining ribosomes.","type":"content","url":"/docs/processes/make-ribosomes/process-make-ribosomes#ultracentrifugation","position":13},{"hierarchy":{"lvl1":"Make Ribosomes","lvl3":"Quality Control","lvl2":"Protocol"},"type":"lvl3","url":"/docs/processes/make-ribosomes/process-make-ribosomes#quality-control","position":14},{"hierarchy":{"lvl1":"Make Ribosomes","lvl3":"Quality Control","lvl2":"Protocol"},"content":" Determine the ribosome concentration by measuring the absorbance at 260 nm at a 100x dilution in Ribosome Buffer. 10 units of A260 from a 100x dilution corresponds to 23 uM of undiluted solution.\n\n Dilute to final stock of 10 uM. To adjust the concentration, dilute the ribosomes with ribosome buffer or concentrate further via centrifugation at 4000 rcf in a 100 kDa centrifugal filter at 4C.\n\n Protein gel: dilute 10 uM sample by 4x (Add 2.5 uL of sample with 7.5 uL water) and mix with 10 uL of 4x Laemmli with BME loading buffer. Boil samples at 90C for 10 minutes and load 5 uL and 2.5 uL onto 4-20% tris-glycine gel. Run gel at 200 V / 30-45 min or until the loading dye line reaches the bottom of the gel.","type":"content","url":"/docs/processes/make-ribosomes/process-make-ribosomes#quality-control","position":15},{"hierarchy":{"lvl1":"Make Ribosomes","lvl3":"Storage","lvl2":"Protocol"},"type":"lvl3","url":"/docs/processes/make-ribosomes/process-make-ribosomes#storage","position":16},{"hierarchy":{"lvl1":"Make Ribosomes","lvl3":"Storage","lvl2":"Protocol"},"content":"Aliquot your ribosomes to reduce freeze / thaw cycles and store at -80C.","type":"content","url":"/docs/processes/make-ribosomes/process-make-ribosomes#storage","position":17},{"hierarchy":{"lvl1":"Make Small Molecule Mix"},"type":"lvl1","url":"/docs/processes/make-small-molecule-mix/process-make-small-molecule-mix","position":0},{"hierarchy":{"lvl1":"Make Small Molecule Mix"},"content":"","type":"content","url":"/docs/processes/make-small-molecule-mix/process-make-small-molecule-mix","position":1},{"hierarchy":{"lvl1":"Make Small Molecule Mix","lvl2":"Overview"},"type":"lvl2","url":"/docs/processes/make-small-molecule-mix/process-make-small-molecule-mix#overview","position":2},{"hierarchy":{"lvl1":"Make Small Molecule Mix","lvl2":"Overview"},"content":"Small Molecule Mix is a combination of thirty-one (31) small molecules (e.g., rNTPs, amino acids, buffering salts, etc.) needed to fuel transcription and translation. Here, we describe the components of Small Molecule Mix, how to make it, and how to store it properly.\n\nImportant Information\n\nPlease read this section carefully. It contains important notes, resources, and safety information. Not all information included here is included in the lab-ready protocol.\n\nNotes\n\nTODO\n\nResources\n\nTODO: Lab-ready Protocol\n\ndownload\n\nAssembly Worksheet\n\ndownload\n\nTODO: Bill of Materials\n\ndownload\n\nComposition\n\nComposition of Small Molecule Mix\n\nReagent\n\nConcentration in Energy Mix (mM)\n\nConcentration in Final Reaction (mM)\n\nHEPES-KOH (pH 7.6)\n\n125\n\n50\n\nPotassium glutamate\n\n250\n\n100\n\nMagnesium acetate\n\n18.75\n\n7.5\n\nrATP\n\n5\n\n2\n\nrGTP\n\n5\n\n2\n\nrCTP\n\n2.5\n\n1\n\nrUTP\n\n2.5\n\n1\n\nAmino Acids (each)\n\n0.75\n\n0.3\n\nCreatine phosphate\n\n50\n\n20\n\nFolinic acid\n\n0.05\n\n0.02\n\nSpermidine\n\n5\n\n2\n\nTCEP\n\n2.5\n\n1\n\nPrerequisite Documentation\n\nMake Amino Acid Mix (3.25 mM)\n\nCritical Materials\n\nReagent\n\nProduct Name\n\nManufacturer\n\nPart #\n\nPrice\n\nStorage Conditions\n\nLink\n\nFolinic acid\n\nFolinic acid calcium salt hydrate\n\nSigma-Aldrich\n\nF7878-100MG\n\n$108\n\n4C to 30C\n\n[\n\nlink]\n\nGenetically Encoded Components\n\nNone\n\nHazardous Materials\n\nNone\n\nReferences\n\nNone protocol starts after this line ","type":"content","url":"/docs/processes/make-small-molecule-mix/process-make-small-molecule-mix#overview","position":3},{"hierarchy":{"lvl1":"Make Small Molecule Mix","lvl2":"Protocol"},"type":"lvl2","url":"/docs/processes/make-small-molecule-mix/process-make-small-molecule-mix#protocol","position":4},{"hierarchy":{"lvl1":"Make Small Molecule Mix","lvl2":"Protocol"},"content":"","type":"content","url":"/docs/processes/make-small-molecule-mix/process-make-small-molecule-mix#protocol","position":5},{"hierarchy":{"lvl1":"Make Small Molecule Mix","lvl3":"Make Small Molecule Stock Solutions","lvl2":"Protocol"},"type":"lvl3","url":"/docs/processes/make-small-molecule-mix/process-make-small-molecule-mix#make-small-molecule-stock-solutions","position":6},{"hierarchy":{"lvl1":"Make Small Molecule Mix","lvl3":"Make Small Molecule Stock Solutions","lvl2":"Protocol"},"content":"Prepare Folinic Acid Stock (5 mM).\n\n Weigh 12.5 mg folinic acid.\n\n Dissolve to a final volume of 4.89 mL.\n\n Aliquot and freeze at -20C.\n\nMake All Other Stock Solutions.\n\nUse the table below to prepare the specified stock solutions:\n\nReagent\n\nMW (g/mol)\n\nAmount (g)\n\nFinal Volume (mL)\n\nStorage\n\nNeeds pH adjustment?\n\nNeeds Sterilization?\n\nPotassium Hydroxide (1 M)\n\n56.11\n\n14.0\n\n250\n\n4C to 30C\n\nno\n\nno\n\nHEPES-KOH (pH 7.6, 1 M)\n\n238.3\n\n59.5\n\n250\n\n4C to 30C; dark\n\nyes\n\nno\n\nPotassium glutamate (2.5 M)\n\n203.23\n\n21.8\n\n50\n\n4C to 30C\n\nno\n\nno\n\nMagnesium acetate (1 M)\n\n214.45\n\n10.8\n\n50\n\n4C to 30C\n\nno\n\nno\n\nCreatine phosphate (500 mM)\n\n327.14\n\n1\n\n9.43\n\n-25C to -15C\n\nno\n\nno\n\nFolinic acid (5 mM)\n\n511.50\n\nSee above\n\n\n\n-25C to -15C\n\nno\n\nno\n\nSpermidine (500 mM)\n\n145.25\n\n1\n\n13.77\n\n-25C to -15C\n\nno\n\nno\n\nAmino Acid Mix\n\n\n\n\n\nsee \n\nMake Amino Acid Mix\n\n-85C to -15C\n\nyes\n\nyes **Assemble Small Molecule Mix Components.** ","type":"content","url":"/docs/processes/make-small-molecule-mix/process-make-small-molecule-mix#make-small-molecule-stock-solutions","position":7},{"hierarchy":{"lvl1":"Make Small Molecule Mix","lvl3":"Assemble Small Molecule Mix.","lvl2":"Protocol"},"type":"lvl3","url":"/docs/processes/make-small-molecule-mix/process-make-small-molecule-mix#assemble-small-molecule-mix","position":8},{"hierarchy":{"lvl1":"Make Small Molecule Mix","lvl3":"Assemble Small Molecule Mix.","lvl2":"Protocol"},"content":"Use the table below to combine the previously prepared stock solutions into Small Molecule Mix:\n\nReagent\n\nStock Concentration (mM)\n\nConcentration in Energy Mix (mM)\n\nVolume to Add (uL)\n\nHEPES-KOH (pH 7.6)\n\n1000\n\n125\n\n62.5\n\nPotassium glutamate\n\n2500\n\n250\n\n50.0\n\nMagnesium acetate\n\n1000\n\n18.75\n\n9.38\n\nrATP\n\n100\n\n5\n\n25.0\n\nrGTP\n\n100\n\n5\n\n25.0\n\nrCTP\n\n100\n\n2.5\n\n12.5\n\nrUTP\n\n100\n\n2.5\n\n12.5\n\nCreatine phosphate\n\n500\n\n50\n\n50.0\n\nTCEP\n\n500\n\n2.5\n\n2.5\n\nFolinic acid\n\n5\n\n0.05\n\n5.0\n\nSpermidine\n\n500\n\n5\n\n5.0\n\nAmino Acid Mix\n\n3.25\n\n0.75\n\n115.4\n\nUltrapure water\n\nn/a\n\nn/a\n\n15.82\n\nTotal\n\n\n\n\n\n500 **Storage.** ","type":"content","url":"/docs/processes/make-small-molecule-mix/process-make-small-molecule-mix#assemble-small-molecule-mix","position":9},{"hierarchy":{"lvl1":"Make Small Molecule Mix","lvl3":"Storage","lvl2":"Protocol"},"type":"lvl3","url":"/docs/processes/make-small-molecule-mix/process-make-small-molecule-mix#storage","position":10},{"hierarchy":{"lvl1":"Make Small Molecule Mix","lvl3":"Storage","lvl2":"Protocol"},"content":" Aliquot Energy Mix into 1.5 mL microfuge tubes (between 50 uL and 100 uL per aliquot) and store at -80C.","type":"content","url":"/docs/processes/make-small-molecule-mix/process-make-small-molecule-mix#storage","position":11},{"hierarchy":{"lvl1":"Protocol"},"type":"lvl1","url":"/docs/processes/make-test/process-make-test","position":0},{"hierarchy":{"lvl1":"Protocol"},"content":"BREAKS: Here is a link: \n\nTest Link\n\nBREAKS: Here is a link: \n\nTest Link\n\nBREAKS: Here is a link: (\n\nEnergy Mix)\n\ntest link","type":"content","url":"/docs/processes/make-test/process-make-test","position":1},{"hierarchy":{"lvl1":"Make tRNAs"},"type":"lvl1","url":"/docs/processes/make-trna/process-make-trnas","position":0},{"hierarchy":{"lvl1":"Make tRNAs"},"content":"","type":"content","url":"/docs/processes/make-trna/process-make-trnas","position":1},{"hierarchy":{"lvl1":"Make tRNAs","lvl2":"Overview"},"type":"lvl2","url":"/docs/processes/make-trna/process-make-trnas#overview","position":2},{"hierarchy":{"lvl1":"Make tRNAs","lvl2":"Overview"},"content":"Transfer RNAs (tRNAs) are small RNA molecules (76 - 90) nt that carry amino acids to ribosomes during protein synthesis. They are essential for translation and can be easily purified following this protocol, which covers bacterial growth, purification, dialysis, and quality assurance. You can use these tRNAs in Make Energy Mix.\n\nImportant Information\n\nPlease read this section carefully. It contains important notes, resources, and safety information. Not all information included here is included in the lab-ready protocol.\n\nNotes\n\nWe purify RNAs and Riboproteins from E. coli A19 biomass (\n\nCGSC 5997), a strain with a mutation in RNase I that improves RNA yields. You can use other RNase deficient strains with this protocol, but you may need to optimize this protocol to achieve high yield and purity.\n\n‼️All reagents and materials must be prepared RNase-free. Use RNaseZap or 10% bleach to decontaminate plastic and glassware and rinse with nuclease-free water. We find ultrapure water (18.2 MOhm) is often sufficient for RNase-free work.\n\nResources\n\nTODO: Lab-ready Protocol\n\ndownload\n\nAssembly Worksheet\n\ndownload\n\nTODO: Bill of Materials\n\ndownload\n\nComposition\n\nComposition of tRNAs\n\nTODO\n\n | **Reagent** | **Concentration in Energy Mix (mM)** | **Concentration in Final Reaction (mM)** | \n\nPrerequisite Documentation\n\nNone\n\nCritical Materials\n\nTODO\n\n | Reagent | **Product Name** | **Manufacturer** | **Part #** | **Price** | Storage Conditions | **Link** |\n| --- | --- | --- | --- | --- | --- | --- |\n| Amino Acids | L-Amino acids, analytical standard | Sigma-Aldrich | LAA21-1KT | $558 | 1C to 4C | [[link](https://www.sigmaaldrich.com/US/en/product/sial/laa21)] |\n| Low Bind Protein Tubes | X | X | X | X | X | X | \n\nGenetically Encoded Components\n\nNone\n\nHazardous Materials\n\nAcid Phenol\n\nCorrosive, toxic, rapidly absorbed through skin, & respiratory irritant\n\nUse in fume hood, wear neoprene gloves, & PPE\n\nAcetic Acid\n\nCorrosive to skin and eyes\n\nUse appropriate PPE and handle under fume-hood\n\nChloroform\n\nIrritant, possible carcinogen\n\nWork in fume hood & appropriate gloves\n\nEthanol\n\nHighly flammable, toxic, and irritant\n\nWear PPE, use in well-ventilated areas, and keep away from open flames\n\nReferences\n\nNone","type":"content","url":"/docs/processes/make-trna/process-make-trnas#overview","position":3},{"hierarchy":{"lvl1":"Make tRNAs","lvl2":"Protocol"},"type":"lvl2","url":"/docs/processes/make-trna/process-make-trnas#protocol","position":4},{"hierarchy":{"lvl1":"Make tRNAs","lvl2":"Protocol"},"content":"","type":"content","url":"/docs/processes/make-trna/process-make-trnas#protocol","position":5},{"hierarchy":{"lvl1":"Make tRNAs","lvl3":"Cell culture","lvl2":"Protocol"},"type":"lvl3","url":"/docs/processes/make-trna/process-make-trnas#cell-culture","position":6},{"hierarchy":{"lvl1":"Make tRNAs","lvl3":"Cell culture","lvl2":"Protocol"},"content":"Note: you can work from glycerol stocks OR colonies.\n\nWe first need to prepare bacterial cultures. We will work from 6 mL overnight cultures of our expression strains and backdilute them the next day. In order to prepare these overnight cultures, we need stocks of bacteria.\n\nWe worked from 100 uL aliquots of our glycerol stocks, frozen in PCR strip tubes. When seeding our overnights with bacteria, we poked one glycerol aliquot with a pipette tip and ejected the tip into culture tubes (more details below).\n\nOptionally, you can work from individual colonies by streaking out your bacterial stocks. Working from colonies assures that your bulk outgrowth will have come from a single colony forming unit.\n\nPrepare overnight cultures.\n\n Add 6 mL Luria Broth (LB) under sterile conditions to two (2) 14 mL culture tubes. 6 mL is enough to innoculate 4 x 900 mL bulk outgrowths.\n\n Label one tube “(+)”. Add 10 uL of A19 glycerol stock to (+).\n\n Label the other tube “(-)”. This will be your negative control, testing if your technique is sterile.\n\n Incubate both tubes overnight shaking at 37C / (225 - 250) rpm / (10 - 16) hr.\n\nPerform bulk outgrowth.\n\n Check if (-) has growth. If not, continue.\n\n Back dilute overnight 1:500 - 1:1000 into 4x 900 mL fresh LB in 2 L baffled Erlenmeyer flasks (e.g., 900 uL overnight into 900 mL LB).\n\n Incubate back diluted cultures at 37C / (225-250) rpm to mid-log phase (OD600 between 0.6 and 0.8). This took us ~3 hrs.\n\nPellet, wash, and store cells.\n\n Fill 500 mL centrifuge bottles with culture. Balance centrifuge bottles against each other and centrifuge cultures at 16 000 rcf / 4C / 10 min.\n\n Decant supernatant, add fresh culture, and repeat centrifugation as above, working through the remaining culture. You should end up with large pellets at the bottom of each centrifuge bottle.\n\n Wash the pellets by resuspending in 500 mL cold (4C) NaCl (0.9%) then re-pelleting at 16 000 rcf / 4C / 10 min.\n\n Transfer pellets by spatula into a tared bag weigh and record the mass.\n\n Flash freeze pellet in liquid nitrogen and store at -80C.","type":"content","url":"/docs/processes/make-trna/process-make-trnas#cell-culture","position":7},{"hierarchy":{"lvl1":"Make tRNAs","lvl3":"Nucleus acid extraction by precipitation","lvl2":"Protocol"},"type":"lvl3","url":"/docs/processes/make-trna/process-make-trnas#nucleus-acid-extraction-by-precipitation","position":8},{"hierarchy":{"lvl1":"Make tRNAs","lvl3":"Nucleus acid extraction by precipitation","lvl2":"Protocol"},"content":"First Nucleic Acid Extraction:\n\n Set centrifuge to 4C and set shaking incubator to 37C.\n\n Resuspend 2 g of biomass into 18 mL of Extraction Buffer: NaOAc (50 mM), Mg(OAc)2 (10 mM), pH 5.0 in a 50 mL centrifuge tube by vortexing.\n\n Add 18 mL of Acid Phenol (pH 4.5) using a glass serological pipette in a fume hood.\n\n Cap the 50 mL centrifuge tube and seal with parafilm to prevent spillage.\n\n Incubate at 37C / 225 rpm / 30 min in a shaking incubator. Tape tubes against the bottom plate of the shaking incubator horizontally so that samples are shaking laterally.\n\n Centrifuge at 4000 rcf / 4C / 15 min. You should observe three (3) layers: the aqueous (top) fraction, the organic (lower) fraction, and a middle fraction of cell debris separating them.\n\n Carefully collect the aqueous fraction by serological pipette, without disturbing the cell debris fraction, and transfer to a fresh 50 mL centrifuge tube.\n\nSecond Nucleic Acid Extraction:\n\n Add 14 mL of Extraction Buffer to Acid Phenol, parafilm the 50 mL centrifuge tube, and incubate at 37C / 225 rpm / 15 min.\n\n Centrifuge at 4000 rcf / 4C / 15 min.\n\n Collect the aqueous fraction and combine with the first nucleic acid extraction (total volume between 30 mL and 32 mL).\n\nPhenol Clean-up:\n\n Split aqueous layer into 2x 50 mL centrifuge tubes and add one volume chloroform (~16 mL) to each tube using a glass serological pipette. Vortex for 5 minutes at RT.\n\n Centrifuge at 4000 rcf  / 4C /  15 min. You should see two (2) fractions: the aqueous (top) fraction and the organic (lower) fraction. The aqueous fraction should be more clear after washing with chloroform.\n\n Collect the aqueous fraction and transfer to a fresh 50 mL centrifuge tube.\n\nPrecipitate Nucleic Acids (RNA & DNA):\n\n Set centrifuge to 25C.\n\n Add NaCl (5 M) to the aqueous phase to a final concentration of 0.2 M (~1.5 mL). Mix by inversion and split evenly into 2x 50 mL centrifuge tubes.\n\n Precipitate nucleic acids by adding one volume of isopropanol (~17 mL) to each tube and incubate at RT for 10 min. The mixture should turn cloudy.\n\n Pellet nucleic acid precipitate via centrifugation at 14 500 rcf / 25C / 15 min.\n\n Wash the pellet with EtOH (70%):\n\n Decant supernatant and wash nucleic acid pellet with 10 mL cold (-20C) EtOH (70%).\n\n Re-pellet nucleic acid pellet by centrifugation at 14 500 rcf / 25C / 5 min.\n\n Decant the supernatant and allow the pellet to air dry for 10 minutes.\n\nRemove rRNA by precipitation:\n\n Resuspend each pellet into 15 mL of cold (4C) NaCl (1 M) by vortexing or pipetting. Ensure the pellet is fully dissolved. Allow NaCl (1 M) solution to hydrate pellet for ~(10 - 15) min at RT to help the pellet dissolve.\n\n Precipitate rRNA by centrifugation at 9500 / 4C / 20 min.\n\n Decant the supernatant to a new 50 mL centrifuge tube.\n\nPrecipitate remaining DNA and tRNA nucleic acids:\n\n Add 2 volumes (~30 mL) of cold (-20C) EtOH (100%) to the supernatant and incubate at -20C / >30 min to precipitate remaining nucleic acids. You can perform this step overnight.\n\n Centrifuge at 14 500 rcf / 4C / 5 min.\n\n Wash the pellet with EtOH (70%) as above.\n\nRemove DNA by precipitation:\n\n Set centrifuge to 25C.\n\n Dissolve the pellet in 6 mL of NaOAc (300 mM, pH 5.0). As needed to ensure the pellet is fully dissolved, heat samples up to 60C, pipette mix, and/or vortex. If the pellet is visibly small, you can dissolve each pellet in 3 mL of NaOAc (0.3 M, pH 5.0) and pool together, totaling 6 mL.\n\n Add 0.56 volumes of isopropanol (~3.4 mL) to each nucleic acid solution and incubate at RT / 10 min.\n\n Centrifuge at 14 500 rcf / RT / 5 min. Decant the supernatant to a 15 mL centrifuge tube.\n\nPrecipitate tRNAs:\n\n Set the centrifuge to 4C.\n\n Add 2.3 mL of isopropanol to the supernatant (supernatant:isopropanol is 100:95) and incubate at -20C / >30 min. This step can be performed overnight.\n\n Centrifuge the suspension at 14 500 rcf / 4C / 15 min.\n\n Wash the pellet with EtOH (70%) as above.\n\n Resuspend tRNA pellet in 1.5 mL of nuclease-free water and keep on ice.","type":"content","url":"/docs/processes/make-trna/process-make-trnas#nucleus-acid-extraction-by-precipitation","position":9},{"hierarchy":{"lvl1":"Make tRNAs","lvl3":"Dialysis","lvl2":"Protocol"},"type":"lvl3","url":"/docs/processes/make-trna/process-make-trnas#dialysis","position":10},{"hierarchy":{"lvl1":"Make tRNAs","lvl3":"Dialysis","lvl2":"Protocol"},"content":" Hydrate membrane: Remove the cassette from its protective pouch and hydrate the membrane by immersing the cassette in nuclease-free water for 2 minutes.\n\n Add Sample:\n\n Open the cassette by twisting the cap counter-clockwise (~45 degrees) and pull out the cap.\n\n Carefully pipette 1.5 mL of resuspended tRNAs into the cassette without puncturing the membrane.\n\n Remove the excess air in the cassette by simultaneously pressing the membrane gently on both sides and inserting the cap and locking it into place.\n\n Dialyze Sample:\n\n Float cassette in 500 mL nuclease-free water in a large (>600 mL) beaker and gently stir at 4C / 45 min. We do this by putting our beaker in a bucket of ice on a stir plate.\n\n Change the dialysis buffer and dialyze for another 45 minutes.\n\nNote: you can dialyze overnight.\n\nDialysis can be done overnight after changing the dialysis buffer at least once. The manufacturer of Slide-A-Lyzer chips recommends dialyzing for 2 hours, then changing the buffer and dialyzing for another two hours. We have found 2 x 45 min sufficient.\n\nFor more detailed instructions on using the Slide-A-Lyzer, please look at manufacturer’s \n\nmanual.","type":"content","url":"/docs/processes/make-trna/process-make-trnas#dialysis","position":11},{"hierarchy":{"lvl1":"Make tRNAs","lvl3":"Concentrate","lvl2":"Protocol"},"type":"lvl3","url":"/docs/processes/make-trna/process-make-trnas#concentrate","position":12},{"hierarchy":{"lvl1":"Make tRNAs","lvl3":"Concentrate","lvl2":"Protocol"},"content":" Pipette dialyzed tRNAs to the upper chamber of an Amicon® Ultra-0.5 mL Centrifugal Filter, 3 kDa MWCO.\n\n Centrifuge at 14 000 rcf / 10 min and check the remaining volume in the upper chamber. Repeat until you hit your target volume.\n\nNote: estimate your target volume at 100 uL per 1 g biomass.\n\nFrom our experience, a good rule of thumb is to target a final volume around 100 uL per 1g of biomass used (e.g., 3.6 gDCM → concentrate to ~360 uL (~40 ug/uL tRNAs)).","type":"content","url":"/docs/processes/make-trna/process-make-trnas#concentrate","position":13},{"hierarchy":{"lvl1":"Make tRNAs","lvl3":"Quality control","lvl2":"Protocol"},"type":"lvl3","url":"/docs/processes/make-trna/process-make-trnas#quality-control","position":14},{"hierarchy":{"lvl1":"Make tRNAs","lvl3":"Quality control","lvl2":"Protocol"},"content":"Estimate concentration by UV-Vis Spectroscopy (Nanodrop).\n\n Prepare a 1:1000 dilution of your tRNAs in water.\n\n Measure absorbance at 260 nm, 280 nm, and 230 nm.\n\n Estimate your yield by A260 ([tRNA] = A260 * 40 mg/mL). Typical yield of tRNA is ~ (4-20) mg per gram of cell mass.\n\nEstimate your purity by A260/A230 and A260/A280 (both should be ≥1.8).\n\nNote: [tRNA] = A260 * 40 mg / mL\n\nA260 units (a.k.a. “absorbance units”, or “OD260”) are defined as the amount of light (wavelength = 260 nm) absorbed by a sample resuspended in 1 mL of water as said light passes through 1 cm of said sample.\n\nTypically, this value is measured by diluting a sample until it’s absorbance is in the linear range (0.5 is acceptable), then multiplying the measured absorbance by the dilution factor.\n\nThese units are annoying to design experiments around, but easy to measure. If you want to report mass concentration of your samples instead, you can approximate as ~40 mg/mL per A260 unit of tRNA.\n\nNEB has a great \n\ntool for converting absorbance units to concentrations. Make sure to select “ssRNA”\n\nVisualize purity by TBE-Urea 10% Gel.\n\n (optional) Prepare TBE-Urea 10% Gel\n\n Load gel into gel dock with running buffer.\n\n Pre-run gels at 100 V / 30 min.\n\n Wash wells with running buffer by syringe. You should be able to see urea displaced from the well by change in refractive index.\n\n Prepare tRNA samples:\n\n Dilute tRNAs to 40 ng / uL tRNA in nuclease-free water.\n\n Prepare 20 ng / uL sample by adding 10 uL of 40 ng / uL tRNA to 10 uL 2x TBE-Urea sample buffer.\n\n Prepare an ssRNA ladder. We use the NEB low range ssRNA (2 uL ladder + 2 uL 2x sample buffer).\n\n Incubate sample and and ladder at 65C / 3 min → 4C / hold using a thermal cycler.\n\n Load 200 ng of tRNA (10 uL at 20 ng / uL) onto the TBE-Urea gel and run at 125V / 2.5 hr.\n\n Meanwhile, prepare SYBR-Green stain (4 uL in 40 mL water) to stain gel.\n\n Soak gel in SYBR-Green stain and visualize gel using UV or blue-light transilluminator. You should see multiple distinct bands around 75-90 nt.\n\nNote: RNases digesting your tRNA → smear on gel\n\nIf your sample is contaminated with RNases, your sample quality will decrease as the RNases degrade the tRNAs. A clear sign of tRNA degradation are poorly defined, smeared bands. A clean tRNA prep should have distinct bands.\n\nIf your samples appear as a smear on your gel, consider testing your input buffers and final prep for RNase activity (see below).\n\n(Optional) Measure RNase contamination using Ambion RNaseAlert Lab Test Kit.\n\nWe recommend diluting your tRNAs by adding 2 uL to 40 uL of provided sample buffer.","type":"content","url":"/docs/processes/make-trna/process-make-trnas#quality-control","position":15},{"hierarchy":{"lvl1":"Make tRNAs","lvl3":"Formulation","lvl2":"Protocol"},"type":"lvl3","url":"/docs/processes/make-trna/process-make-trnas#formulation","position":16},{"hierarchy":{"lvl1":"Make tRNAs","lvl3":"Formulation","lvl2":"Protocol"},"content":"Dilute your tRNA stocks in nuclease-free water to your working concentration, depending on your application. We recommend 50 ug / uL to use as a component in Energy Mix, or 35 ug / uL as a 10x stock for PUREΔtRNA reactions (add 1 uL to 10 uL reactions).","type":"content","url":"/docs/processes/make-trna/process-make-trnas#formulation","position":17},{"hierarchy":{"lvl1":"Make tRNAs","lvl3":"Storage","lvl2":"Protocol"},"type":"lvl3","url":"/docs/processes/make-trna/process-make-trnas#storage","position":18},{"hierarchy":{"lvl1":"Make tRNAs","lvl3":"Storage","lvl2":"Protocol"},"content":"[] Aliquot your tRNAs to reduce freeze / thaw cycles and store at -80C.","type":"content","url":"/docs/processes/make-trna/process-make-trnas#storage","position":19},{"hierarchy":{"lvl1":"Make Template"},"type":"lvl1","url":"/docs/processes/process-template/process-make-template","position":0},{"hierarchy":{"lvl1":"Make Template"},"content":"","type":"content","url":"/docs/processes/process-template/process-make-template","position":1},{"hierarchy":{"lvl1":"Make Template","lvl2":"Overview"},"type":"lvl2","url":"/docs/processes/process-template/process-make-template#overview","position":2},{"hierarchy":{"lvl1":"Make Template","lvl2":"Overview"},"content":"Transfer RNAs (tRNAs) are small RNA molecules (76 - 90) nt that carry amino acids to ribosomes during protein synthesis. They are essential for translation and can be easily purified following this protocol, which covers bacterial growth, purification, dialysis, and quality assurance. You can use these tRNAs in Make Energy Mix. The important imformation card begins here  The important imformation card begins here  The important imformation card begins here  The important imformation card begins here  The important imformation card begins here \n\nImportant Information\n\nPlease read this section carefully. It contains important notes, resources, and safety information. Not all information included here is included in the lab-ready protocol.\n\nNotes\n\n‼️All reagents and materials must be prepared RNase-free. Use RNaseZap or 10% bleach to decontaminate plastic and glassware and rinse with nuclease-free water. We find ultrapure water (18.2 MOhm) is often sufficient for RNase-free work.\n\nResources\n\nTODO: Lab-ready Protocol\n\ndownload\n\nAssembly Worksheet\n\ndownload\n\nTODO: Bill of Materials\n\ndownload\n\nComposition\n\nComposition of Small Molecule Mix\n\nReagent\n\nConcentration in Energy Mix (mM)\n\nConcentration in Final Reaction (mM)\n\nHEPES-KOH (pH 7.6)\n\n125\n\n50\n\nPotassium glutamate\n\n250\n\n100\n\nMagnesium acetate\n\n18.75\n\n7.5\n\nrATP\n\n5\n\n2\n\nrGTP\n\n5\n\n2\n\nrCTP\n\n2.5\n\n1\n\nrUTP\n\n2.5\n\n1\n\nAmino Acids (each)\n\n0.75\n\n0.3\n\nCreatine phosphate\n\n50\n\n20\n\nFolinic acid\n\n0.05\n\n0.02\n\nSpermidine\n\n5\n\n2\n\nTCEP\n\n2.5\n\n1\n\nPrerequisite Documentation\n\nNone\n\nCritical Materials\n\nReagent\n\nProduct Name\n\nManufacturer\n\nPart #\n\nPrice\n\nStorage Conditions\n\nLink\n\nAmino Acids\n\nL-Amino acids, analytical standard\n\nSigma-Aldrich\n\nLAA21-1KT\n\n$558\n\n1C to 4C\n\n[\n\nlink]\n\nLow Bind Protein Tubes\n\nX\n\nX\n\nX\n\nX\n\nX\n\nX\n\nGenetically Encoded Components\n\nReagent\n\nProduct Name\n\nManufacturer\n\nPart #\n\nPrice\n\nStorage Conditions\n\nLink\n\nAmino Acids\n\nL-Amino acids, analytical standard\n\nSigma-Aldrich\n\nLAA21-1KT\n\n$558\n\n1C to 4C\n\n[\n\nlink]\n\nLow Bind Protein Tubes\n\nX\n\nX\n\nX\n\nX\n\nX\n\nX\n\nHazardous Materials\n\nAcid Phenol\n\nCorrosive, toxic, rapidly absorbed through skin, & respiratory irritant\n\nUse in fume hood, wear neoprene gloves, & PPE\n\nAcetic Acid\n\nCorrosive to skin and eyes\n\nUse appropriate PPE and handle under fume-hood\n\nChloroform\n\nIrritant, possible carcinogen\n\nWork in fume hood & appropriate gloves\n\nEthanol\n\nHighly flammable, toxic, and irritant\n\nWear PPE, use in well-ventilated areas, and keep away from open flames\n\nReferences\n\nNone The important imformation card ends here  The important imformation card ends here  The important imformation card ends here  The important imformation card ends here  The important imformation card ends here ","type":"content","url":"/docs/processes/process-template/process-make-template#overview","position":3},{"hierarchy":{"lvl1":"Make Template","lvl2":"Protocol"},"type":"lvl2","url":"/docs/processes/process-template/process-make-template#protocol","position":4},{"hierarchy":{"lvl1":"Make Template","lvl2":"Protocol"},"content":"","type":"content","url":"/docs/processes/process-template/process-make-template#protocol","position":5},{"hierarchy":{"lvl1":"Make Template","lvl3":"Cell culture","lvl2":"Protocol"},"type":"lvl3","url":"/docs/processes/process-template/process-make-template#cell-culture","position":6},{"hierarchy":{"lvl1":"Make Template","lvl3":"Cell culture","lvl2":"Protocol"},"content":"Note: you can work from glycerol stocks OR colonies.\n\nWe first need to prepare bacterial cultures. We will work from 6 mL overnight cultures of our expression strains and backdilute them the next day. In order to prepare these overnight cultures, we need stocks of bacteria.\n\nWe worked from 100 uL aliquots of our glycerol stocks, frozen in PCR strip tubes. When seeding our overnights with bacteria, we poked one glycerol aliquot with a pipette tip and ejected the tip into culture tubes (more details below).\n\nOptionally, you can work from individual colonies by streaking out your bacterial stocks. Working from colonies assures that your bulk outgrowth will have come from a single colony forming unit.\n\nPrepare overnight cultures.\n\n Add 6 mL Luria Broth (LB) under sterile conditions to two (2) 14 mL culture tubes. 6 mL is enough to innoculate 4 x 900 mL bulk outgrowths.\n\n Label one tube “(+)”. Add 10 uL of A19 glycerol stock to (+).\n\n Label the other tube “(-)”. This will be your negative control, testing if your technique is sterile.\n\n Incubate both tubes overnight shaking at 37C / (225 - 250) rpm / (10 - 16) hr.\n\nPerform bulk outgrowth.\n\n Check if (-) has growth. If not, continue.\n\n Back dilute overnight 1:500 - 1:1000 into 4x 900 mL fresh LB in 2 L baffled Erlenmeyer flasks (e.g., 900 uL overnight into 900 mL LB).\n\n Incubate back diluted cultures at 37C / (225-250) rpm to mid-log phase (OD600 between 0.6 and 0.8). This took us ~3 hrs.\n\nPellet, wash, and store cells.\n\n Fill 500 mL centrifuge bottles with culture. Balance centrifuge bottles against each other and centrifuge cultures at 16 000 rcf / 4C / 10 min.\n\n Decant supernatant, add fresh culture, and repeat centrifugation as above, working through the remaining culture. You should end up with large pellets at the bottom of each centrifuge bottle.\n\n Wash the pellets by resuspending in 500 mL cold (4C) NaCl (0.9%) then re-pelleting at 16 000 rcf / 4C / 10 min.\n\n Transfer pellets by spatula into a tared bag weigh and record the mass.\n\n Flash freeze pellet in liquid nitrogen and store at -80C.","type":"content","url":"/docs/processes/process-template/process-make-template#cell-culture","position":7},{"hierarchy":{"lvl1":"Make Template","lvl3":"Nucleus acid extraction by precipitation","lvl2":"Protocol"},"type":"lvl3","url":"/docs/processes/process-template/process-make-template#nucleus-acid-extraction-by-precipitation","position":8},{"hierarchy":{"lvl1":"Make Template","lvl3":"Nucleus acid extraction by precipitation","lvl2":"Protocol"},"content":"First Nucleic Acid Extraction:\n\n Set centrifuge to 4C and set shaking incubator to 37C.\n\n Resuspend 2 g of biomass into 18 mL of Extraction Buffer: NaOAc (50 mM), Mg(OAc)2 (10 mM), pH 5.0 in a 50 mL centrifuge tube by vortexing.\n\n Add 18 mL of Acid Phenol (pH 4.5) using a glass serological pipette in a fume hood.\n\n Cap the 50 mL centrifuge tube and seal with parafilm to prevent spillage.\n\n Incubate at 37C / 225 rpm / 30 min in a shaking incubator. Tape tubes against the bottom plate of the shaking incubator horizontally so that samples are shaking laterally.\n\n Centrifuge at 4000 rcf / 4C / 15 min. You should observe three (3) layers: the aqueous (top) fraction, the organic (lower) fraction, and a middle fraction of cell debris separating them.\n\n Carefully collect the aqueous fraction by serological pipette, without disturbing the cell debris fraction, and transfer to a fresh 50 mL centrifuge tube.\n\nSecond Nucleic Acid Extraction:\n\n Add 14 mL of Extraction Buffer to Acid Phenol, parafilm the 50 mL centrifuge tube, and incubate at 37C / 225 rpm / 15 min.\n\n Centrifuge at 4000 rcf / 4C / 15 min.\n\n Collect the aqueous fraction and combine with the first nucleic acid extraction (total volume between 30 mL and 32 mL).\n\nPhenol Clean-up:\n\n Split aqueous layer into 2x 50 mL centrifuge tubes and add one volume chloroform (~16 mL) to each tube using a glass serological pipette. Vortex for 5 minutes at RT.\n\n Centrifuge at 4000 rcf  / 4C /  15 min. You should see two (2) fractions: the aqueous (top) fraction and the organic (lower) fraction. The aqueous fraction should be more clear after washing with chloroform.\n\n Collect the aqueous fraction and transfer to a fresh 50 mL centrifuge tube.\n\nPrecipitate Nucleic Acids (RNA & DNA):\n\n Set centrifuge to 25C.\n\n Add NaCl (5 M) to the aqueous phase to a final concentration of 0.2 M (~1.5 mL). Mix by inversion and split evenly into 2x 50 mL centrifuge tubes.\n\n Precipitate nucleic acids by adding one volume of isopropanol (~17 mL) to each tube and incubate at RT for 10 min. The mixture should turn cloudy.\n\n Pellet nucleic acid precipitate via centrifugation at 14 500 rcf / 25C / 15 min.\n\n Wash the pellet with EtOH (70%):\n\n Decant supernatant and wash nucleic acid pellet with 10 mL cold (-20C) EtOH (70%).\n\n Re-pellet nucleic acid pellet by centrifugation at 14 500 rcf / 25C / 5 min.\n\n Decant the supernatant and allow the pellet to air dry for 10 minutes.\n\nRemove rRNA by precipitation:\n\n Resuspend each pellet into 15 mL of cold (4C) NaCl (1 M) by vortexing or pipetting. Ensure the pellet is fully dissolved. Allow NaCl (1 M) solution to hydrate pellet for ~(10 - 15) min at RT to help the pellet dissolve.\n\n Precipitate rRNA by centrifugation at 9500 / 4C / 20 min.\n\n Decant the supernatant to a new 50 mL centrifuge tube.\n\nPrecipitate remaining DNA and tRNA nucleic acids:\n\n Add 2 volumes (~30 mL) of cold (-20C) EtOH (100%) to the supernatant and incubate at -20C / >30 min to precipitate remaining nucleic acids. You can perform this step overnight.\n\n Centrifuge at 14 500 rcf / 4C / 5 min.\n\n Wash the pellet with EtOH (70%) as above.\n\nRemove DNA by precipitation:\n\n Set centrifuge to 25C.\n\n Dissolve the pellet in 6 mL of NaOAc (300 mM, pH 5.0). As needed to ensure the pellet is fully dissolved, heat samples up to 60C, pipette mix, and/or vortex. If the pellet is visibly small, you can dissolve each pellet in 3 mL of NaOAc (0.3 M, pH 5.0) and pool together, totaling 6 mL.\n\n Add 0.56 volumes of isopropanol (~3.4 mL) to each nucleic acid solution and incubate at RT / 10 min.\n\n Centrifuge at 14 500 rcf / RT / 5 min. Decant the supernatant to a 15 mL centrifuge tube.\n\nPrecipitate tRNAs:\n\n Set the centrifuge to 4C.\n\n Add 2.3 mL of isopropanol to the supernatant (supernatant:isopropanol is 100:95) and incubate at -20C / >30 min. This step can be performed overnight.\n\n Centrifuge the suspension at 14 500 rcf / 4C / 15 min.\n\n Wash the pellet with EtOH (70%) as above.\n\n Resuspend tRNA pellet in 1.5 mL of nuclease-free water and keep on ice.","type":"content","url":"/docs/processes/process-template/process-make-template#nucleus-acid-extraction-by-precipitation","position":9},{"hierarchy":{"lvl1":"Make Template","lvl3":"Dialysis","lvl2":"Protocol"},"type":"lvl3","url":"/docs/processes/process-template/process-make-template#dialysis","position":10},{"hierarchy":{"lvl1":"Make Template","lvl3":"Dialysis","lvl2":"Protocol"},"content":" Hydrate membrane: Remove the cassette from its protective pouch and hydrate the membrane by immersing the cassette in nuclease-free water for 2 minutes.\n\n Add Sample:\n\n Open the cassette by twisting the cap counter-clockwise (~45 degrees) and pull out the cap.\n\n Carefully pipette 1.5 mL of resuspended tRNAs into the cassette without puncturing the membrane.\n\n Remove the excess air in the cassette by simultaneously pressing the membrane gently on both sides and inserting the cap and locking it into place.\n\n Dialyze Sample:\n\n Float cassette in 500 mL nuclease-free water in a large (>600 mL) beaker and gently stir at 4C / 45 min. We do this by putting our beaker in a bucket of ice on a stir plate.\n\n Change the dialysis buffer and dialyze for another 45 minutes.\n\nNote: you can dialyze overnight.\n\nDialysis can be done overnight after changing the dialysis buffer at least once. The manufacturer of Slide-A-Lyzer chips recommends dialyzing for 2 hours, then changing the buffer and dialyzing for another two hours. We have found 2 x 45 min sufficient.\n\nFor more detailed instructions on using the Slide-A-Lyzer, please look at manufacturer’s \n\nmanual.","type":"content","url":"/docs/processes/process-template/process-make-template#dialysis","position":11},{"hierarchy":{"lvl1":"Make Template","lvl3":"Concentrate","lvl2":"Protocol"},"type":"lvl3","url":"/docs/processes/process-template/process-make-template#concentrate","position":12},{"hierarchy":{"lvl1":"Make Template","lvl3":"Concentrate","lvl2":"Protocol"},"content":" Pipette dialyzed tRNAs to the upper chamber of an Amicon® Ultra-0.5 mL Centrifugal Filter, 3 kDa MWCO.\n\n Centrifuge at 14 000 rcf / 10 min and check the remaining volume in the upper chamber. Repeat until you hit your target volume.\n\nNote: estimate your target volume at 100 uL per 1 g biomass.\n\nFrom our experience, a good rule of thumb is to target a final volume around 100 uL per 1g of biomass used (e.g., 3.6 gDCM → concentrate to ~360 uL (~40 ug/uL tRNAs)).","type":"content","url":"/docs/processes/process-template/process-make-template#concentrate","position":13},{"hierarchy":{"lvl1":"Make Template","lvl3":"Quality control","lvl2":"Protocol"},"type":"lvl3","url":"/docs/processes/process-template/process-make-template#quality-control","position":14},{"hierarchy":{"lvl1":"Make Template","lvl3":"Quality control","lvl2":"Protocol"},"content":"Estimate concentration by UV-Vis Spectroscopy (Nanodrop).\n\n Prepare a 1:1000 dilution of your tRNAs in water.\n\n Measure absorbance at 260 nm, 280 nm, and 230 nm.\n\n Estimate your yield by A260 ([tRNA] = A260 * 40 mg/mL). Typical yield of tRNA is ~ (4-20) mg per gram of cell mass.\n\nEstimate your purity by A260/A230 and A260/A280 (both should be ≥1.8).\n\nNote: [tRNA] = A260 * 40 mg / mL\n\nA260 units (a.k.a. “absorbance units”, or “OD260”) are defined as the amount of light (wavelength = 260 nm) absorbed by a sample resuspended in 1 mL of water as said light passes through 1 cm of said sample.\n\nTypically, this value is measured by diluting a sample until it’s absorbance is in the linear range (0.5 is acceptable), then multiplying the measured absorbance by the dilution factor.\n\nThese units are annoying to design experiments around, but easy to measure. If you want to report mass concentration of your samples instead, you can approximate as ~40 mg/mL per A260 unit of tRNA.\n\nNEB has a great \n\ntool for converting absorbance units to concentrations. Make sure to select “ssRNA”\n\nVisualize purity by TBE-Urea 10% Gel.\n\n (optional) Prepare TBE-Urea 10% Gel\n\n Load gel into gel dock with running buffer.\n\n Pre-run gels at 100 V / 30 min.\n\n Wash wells with running buffer by syringe. You should be able to see urea displaced from the well by change in refractive index.\n\n Prepare tRNA samples:\n\n Dilute tRNAs to 40 ng / uL tRNA in nuclease-free water.\n\n Prepare 20 ng / uL sample by adding 10 uL of 40 ng / uL tRNA to 10 uL 2x TBE-Urea sample buffer.\n\n Prepare an ssRNA ladder. We use the NEB low range ssRNA (2 uL ladder + 2 uL 2x sample buffer).\n\n Incubate sample and and ladder at 65C / 3 min → 4C / hold using a thermal cycler.\n\n Load 200 ng of tRNA (10 uL at 20 ng / uL) onto the TBE-Urea gel and run at 125V / 2.5 hr.\n\n Meanwhile, prepare SYBR-Green stain (4 uL in 40 mL water) to stain gel.\n\n Soak gel in SYBR-Green stain and visualize gel using UV or blue-light transilluminator. You should see multiple distinct bands around 75-90 nt.\n\nNote: RNases digesting your tRNA → smear on gel\n\nIf your sample is contaminated with RNases, your sample quality will decrease as the RNases degrade the tRNAs. A clear sign of tRNA degradation are poorly defined, smeared bands. A clean tRNA prep should have distinct bands.\n\nIf your samples appear as a smear on your gel, consider testing your input buffers and final prep for RNase activity (see below).\n\n(Optional) Measure RNase contamination using Ambion RNaseAlert Lab Test Kit.\n\nWe recommend diluting your tRNAs by adding 2 uL to 40 uL of provided sample buffer.","type":"content","url":"/docs/processes/process-template/process-make-template#quality-control","position":15},{"hierarchy":{"lvl1":"Make Template","lvl3":"Formulation","lvl2":"Protocol"},"type":"lvl3","url":"/docs/processes/process-template/process-make-template#formulation","position":16},{"hierarchy":{"lvl1":"Make Template","lvl3":"Formulation","lvl2":"Protocol"},"content":"Dilute your tRNA stocks in nuclease-free water to your working concentration, depending on your application. We recommend 50 ug / uL to use as a component in Energy Mix, or 35 ug / uL as a 10x stock for PUREΔtRNA reactions (add 1 uL to 10 uL reactions).","type":"content","url":"/docs/processes/process-template/process-make-template#formulation","position":17},{"hierarchy":{"lvl1":"Make Template","lvl3":"Storage","lvl2":"Protocol"},"type":"lvl3","url":"/docs/processes/process-template/process-make-template#storage","position":18},{"hierarchy":{"lvl1":"Make Template","lvl3":"Storage","lvl2":"Protocol"},"content":"Aliquot your tRNAs to reduce freeze / thaw cycles and store at -80C.","type":"content","url":"/docs/processes/process-template/process-make-template#storage","position":19},{"hierarchy":{"lvl1":"Processes"},"type":"lvl1","url":"/docs/processes/processes-main","position":0},{"hierarchy":{"lvl1":"Processes"},"content":"","type":"content","url":"/docs/processes/processes-main","position":1},{"hierarchy":{"lvl1":"Processes","lvl2":"Overview"},"type":"lvl2","url":"/docs/processes/processes-main#overview","position":2},{"hierarchy":{"lvl1":"Processes","lvl2":"Overview"},"content":"Processes convert Modules into something useful. A Process often coincides with the simplest possible Implementation, typyically using the plamGFP Reporter Module. For this reason, we often refer to these as \n\n“Hello, World!” implementations. Alternatively, a process will include a quality control and \n\nunit tests A Process will contain the following information:\n\nContents of an implementation\n\nlab-ready protocol\n\nBill of materials\n\nList of what to have at your bench\n\nRecommendations for storage and unit testing","type":"content","url":"/docs/processes/processes-main#overview","position":3},{"hierarchy":{"lvl1":"Processes","lvl3":"Cytosols","lvl2":"Overview"},"type":"lvl3","url":"/docs/processes/processes-main#cytosols","position":4},{"hierarchy":{"lvl1":"Processes","lvl3":"Cytosols","lvl2":"Overview"},"content":"Here are a collection of processes that are useful for making and working with Cytosols\n\n\n\nFigure 1:Flow chart for building Base Cytosol and its modification through the addition of Modules.\n\nProcess Template\n\nMake Amino Acid Mix\n\nMake Small Molecule Mix - [Make tRNAs](https://antonrmolina.github.io/nucleus-distribution-pages/docs/processes/make-trna/process-make-trnas) \n\nMake tRNAs\n\nMake Energy Mix\n\nMake Protein mix (1-pot)\n\nMake Protein mix (36-pot) - [Make Ribosomes](https://antonrmolina.github.io/nucleus-distribution-pages/docs/processes/make-ribosomes/process-make-ribosomes) \n\nMake Ribosomes\n\nMake Base cytosol\n\nQuality Control\n\nProtein Gel\n\nPierce660 Assay\n\nBCA Assay\n\nMeasuring fluorescence with plate reader \n\n","type":"content","url":"/docs/processes/processes-main#cytosols","position":5},{"hierarchy":{"lvl1":"Processes","lvl3":"Cells","lvl2":"Overview"},"type":"lvl3","url":"/docs/processes/processes-main#cells","position":6},{"hierarchy":{"lvl1":"Processes","lvl3":"Cells","lvl2":"Overview"},"content":"Here are a collection of processes that useful for making and working with Cells\n\n\n\nFigure 2:Flow chart for building Base Cell and its modification through the addition of Modules.\n\nMake Base Cell\n\nQuality Control\n\nMeasuring fluorescence with microscope","type":"content","url":"/docs/processes/processes-main#cells","position":7},{"hierarchy":{"lvl1":"Contribution Guidelines"},"type":"lvl1","url":"/guides/contribution-guide","position":0},{"hierarchy":{"lvl1":"Contribution Guidelines"},"content":"","type":"content","url":"/guides/contribution-guide","position":1},{"hierarchy":{"lvl1":"Contribution Guidelines","lvl2":"Cytosol"},"type":"lvl2","url":"/guides/contribution-guide#cytosol","position":2},{"hierarchy":{"lvl1":"Contribution Guidelines","lvl2":"Cytosol"},"content":"Requirement levels use key words as described in \n\nRFC 2119\n\nData MUST extend an existing Module, Process, Implementation or MUST otherwise be aligned with the technical roadmap (more simply it should be tested against Nucleus PURE) or is of otherwise profound utility that ignoring the contribution would be detrimental to the well-being of the community.\n\nData MUST be included in a DevNote\n\nData MUST be accompanied by a platemap compatible with the Nucleus CDK\n\nData SHOULD be collected in at least technical triplicate\n\nData SHOULD be collected in reference to an appropriate analytical standard\n\nDocumentation MUST include a bill of materials\n\nDocumentation MUST include design files for genetic constructs\n\nDocumentation SHOULD include sequencing information for the genetic constructs\n\nDocumentation MUST include a lab notebook entry detailing the final concentration of each component in the reactions.\n\nThe lab notebook entry SHOULD include additional details that help others to reproduce the described work","type":"content","url":"/guides/contribution-guide#cytosol","position":3},{"hierarchy":{"lvl1":"Contribution Guidelines","lvl2":"Cells"},"type":"lvl2","url":"/guides/contribution-guide#cells","position":4},{"hierarchy":{"lvl1":"Contribution Guidelines","lvl2":"Cells"},"content":"Question: what is the equivalent of “Data SHOULD be collected in reference to an appropriate analytical standard”\n\nQuestion: how much data should be included?\n\nData should be processed using CDK","type":"content","url":"/guides/contribution-guide#cells","position":5},{"hierarchy":{"lvl1":"Developer Handbook"},"type":"lvl1","url":"/guides/developer-handbook","position":0},{"hierarchy":{"lvl1":"Developer Handbook"},"content":"Chapter 12: Membrane Assembly and Structural Integrity\nLorem ipsum synthetic phospholipid bilayer construction requires careful consideration of lipid composition ratios and amphiphilic molecule orientation. The standard vesicle formation protocol begins with dissolving cholesterol analogues at 15-20 mol% concentration in the primary lipid matrix. Subsequent hydration cycles must maintain osmotic pressure differentials within 50-100 mOsm tolerance ranges to prevent membrane rupture during the initial swelling phase.\nSection 12.3: Load-Bearing Cytoskeletal Framework Design\n\nArtificial actin filament networks demonstrate optimal tensile strength when polymerized at pH 7.4 ± 0.2 with ATP:ADP ratios maintained above 4:1. Cross-linking protein density calculations follow the modified Henderson-Hasselbalch equation for synthetic biochemical systems. Critical buckling loads for microtubule analogues can be determined using Euler’s formula, substituting the synthetic polymer’s elastic modulus (typically 1.2-1.8 GPa for engineered protein composites).\n\nSetting up a synthetic cell lab\n\nA Developer’s guide for organizing your buffers\n\nA developer’s guide for working with the Nucleus Distribution\n\nDevelope’s Own Best practices for experimental design","type":"content","url":"/guides/developer-handbook","position":1},{"hierarchy":{"lvl1":"Developer Handbook","lvl2":"Option 1: Consistent formatting and parallel structure"},"type":"lvl2","url":"/guides/developer-handbook#option-1-consistent-formatting-and-parallel-structure","position":2},{"hierarchy":{"lvl1":"Developer Handbook","lvl2":"Option 1: Consistent formatting and parallel structure"},"content":"Chapter 1: Setting Up a Synthetic Cell Laboratory\n\nChapter 2: Buffer Management and Organization\n\nChapter 3: Working with Nucleus Distribution Systems\n\nChapter 4: Best Practices for Experimental Design","type":"content","url":"/guides/developer-handbook#option-1-consistent-formatting-and-parallel-structure","position":3},{"hierarchy":{"lvl1":"Developer Handbook","lvl2":"Option 2: More descriptive and technical"},"type":"lvl2","url":"/guides/developer-handbook#option-2-more-descriptive-and-technical","position":4},{"hierarchy":{"lvl1":"Developer Handbook","lvl2":"Option 2: More descriptive and technical"},"content":"Laboratory Setup and Infrastructure Requirements\n\nBuffer Preparation, Storage, and Management Protocols\n\nNucleus Distribution: Implementation and Troubleshooting\n\nExperimental Design Principles and Quality Control","type":"content","url":"/guides/developer-handbook#option-2-more-descriptive-and-technical","position":5},{"hierarchy":{"lvl1":"Developer Handbook","lvl2":"Option 3: Handbook-style with subsections"},"type":"lvl2","url":"/guides/developer-handbook#option-3-handbook-style-with-subsections","position":6},{"hierarchy":{"lvl1":"Developer Handbook","lvl2":"Option 3: Handbook-style with subsections"},"content":"Part I: Laboratory Foundation\n\nChapter 1: Facility Setup and Safety Protocols\n\nPart II: Core Methodologies\n\nChapter 2: Buffer Systems and Solution Management\n\nChapter 3: Nucleus Distribution Protocols\n\nPart III: Quality Assurance\n\nChapter 4: Experimental Design and Validation","type":"content","url":"/guides/developer-handbook#option-3-handbook-style-with-subsections","position":7},{"hierarchy":{"lvl1":"Useful Tips and Tricks for Developer Notes"},"type":"lvl1","url":"/guides/developer-note-syntax","position":0},{"hierarchy":{"lvl1":"Useful Tips and Tricks for Developer Notes"},"content":"","type":"content","url":"/guides/developer-note-syntax","position":1},{"hierarchy":{"lvl1":"Useful Tips and Tricks for Developer Notes","lvl2":"Overview"},"type":"lvl2","url":"/guides/developer-note-syntax#overview","position":2},{"hierarchy":{"lvl1":"Useful Tips and Tricks for Developer Notes","lvl2":"Overview"},"content":"Developer Notes (DevNotes) are written using MyST markdown, a flavor of markdown designed specifically for technical communication. The complete MyST markdown documentation can be found \n\nhere.\n\nThe purpose of this document is to share some common MyST syntax patterns that we’ve found useful when writing DevNotes and gather them in one place. This document was prepared by looking at examples of previous DevNotes. We recommend exploring the markdown files of existing DevNotes to see these syntax patterns used in practice. See here for how to explore a DevNote.","type":"content","url":"/guides/developer-note-syntax#overview","position":3},{"hierarchy":{"lvl1":"Useful Tips and Tricks for Developer Notes","lvl2":"Basic syntax"},"type":"lvl2","url":"/guides/developer-note-syntax#basic-syntax","position":4},{"hierarchy":{"lvl1":"Useful Tips and Tricks for Developer Notes","lvl2":"Basic syntax"},"content":"","type":"content","url":"/guides/developer-note-syntax#basic-syntax","position":5},{"hierarchy":{"lvl1":"Useful Tips and Tricks for Developer Notes","lvl3":"Figures","lvl2":"Basic syntax"},"type":"lvl3","url":"/guides/developer-note-syntax#figures","position":6},{"hierarchy":{"lvl1":"Useful Tips and Tricks for Developer Notes","lvl3":"Figures","lvl2":"Basic syntax"},"content":"\n\nmy caption is really long and is being referenced completely...\n\n:::{figure} https://github.com/rowanc1/pics/blob/main/sunset.png?raw=true\n:label: fig:my-fig-1\n:align: center\n\nRelaxing at the beach \n:::\n\nWill appear as...\n\n\n\nRelaxing\n\n:::{figure} https://github.com/rowanc1/pics/blob/main/sunset.png?raw=true\n:label: fig:my-fig-2\n:align: center\n\nRelaxing at the beach 🏝 🌊 😎\n:::\n\nWill appear as...\n\n\n\nRelaxing at the beach 🏝 🌊 😎","type":"content","url":"/guides/developer-note-syntax#figures","position":7},{"hierarchy":{"lvl1":"Useful Tips and Tricks for Developer Notes","lvl3":"Tables","lvl2":"Basic syntax"},"type":"lvl3","url":"/guides/developer-note-syntax#tables","position":8},{"hierarchy":{"lvl1":"Useful Tips and Tricks for Developer Notes","lvl3":"Tables","lvl2":"Basic syntax"},"content":"","type":"content","url":"/guides/developer-note-syntax#tables","position":9},{"hierarchy":{"lvl1":"Useful Tips and Tricks for Developer Notes","lvl3":"Referencing Figures and Tables within a document","lvl2":"Basic syntax"},"type":"lvl3","url":"/guides/developer-note-syntax#referencing-figures-and-tables-within-a-document","position":10},{"hierarchy":{"lvl1":"Useful Tips and Tricks for Developer Notes","lvl3":"Referencing Figures and Tables within a document","lvl2":"Basic syntax"},"content":"As noted the :label: fig:my-fig allows you to references your figure within your document, for example \n\nmy caption is really long and is being referenced completely....","type":"content","url":"/guides/developer-note-syntax#referencing-figures-and-tables-within-a-document","position":11},{"hierarchy":{"lvl1":"Useful Tips and Tricks for Developer Notes","lvl3":"Referencing the literature via DOI","lvl2":"Basic syntax"},"type":"lvl3","url":"/guides/developer-note-syntax#referencing-the-literature-via-doi","position":12},{"hierarchy":{"lvl1":"Useful Tips and Tricks for Developer Notes","lvl3":"Referencing the literature via DOI","lvl2":"Basic syntax"},"content":"","type":"content","url":"/guides/developer-note-syntax#referencing-the-literature-via-doi","position":13},{"hierarchy":{"lvl1":"Useful Tips and Tricks for Developer Notes","lvl2":"Connecting a Jupyter Notebook to your DevNote"},"type":"lvl2","url":"/guides/developer-note-syntax#connecting-a-jupyter-notebook-to-your-devnote","position":14},{"hierarchy":{"lvl1":"Useful Tips and Tricks for Developer Notes","lvl2":"Connecting a Jupyter Notebook to your DevNote"},"content":"","type":"content","url":"/guides/developer-note-syntax#connecting-a-jupyter-notebook-to-your-devnote","position":15},{"hierarchy":{"lvl1":"Useful Tips and Tricks for Developer Notes","lvl2":"Figures"},"type":"lvl2","url":"/guides/developer-note-syntax#figures-1","position":16},{"hierarchy":{"lvl1":"Useful Tips and Tricks for Developer Notes","lvl2":"Figures"},"content":"","type":"content","url":"/guides/developer-note-syntax#figures-1","position":17},{"hierarchy":{"lvl1":"Useful Tips and Tricks for Developer Notes","lvl3":"Figures that include multiple panels","lvl2":"Figures"},"type":"lvl3","url":"/guides/developer-note-syntax#figures-that-include-multiple-panels","position":18},{"hierarchy":{"lvl1":"Useful Tips and Tricks for Developer Notes","lvl3":"Figures that include multiple panels","lvl2":"Figures"},"content":"","type":"content","url":"/guides/developer-note-syntax#figures-that-include-multiple-panels","position":19},{"hierarchy":{"lvl1":"Useful Tips and Tricks for Developer Notes","lvl3":"Using Jupyter Notebooks to make sub-panels","lvl2":"Figures"},"type":"lvl3","url":"/guides/developer-note-syntax#using-jupyter-notebooks-to-make-sub-panels","position":20},{"hierarchy":{"lvl1":"Useful Tips and Tricks for Developer Notes","lvl3":"Using Jupyter Notebooks to make sub-panels","lvl2":"Figures"},"content":"","type":"content","url":"/guides/developer-note-syntax#using-jupyter-notebooks-to-make-sub-panels","position":21},{"hierarchy":{"lvl1":"Useful Tips and Tricks for Developer Notes","lvl2":"Tables"},"type":"lvl2","url":"/guides/developer-note-syntax#tables-1","position":22},{"hierarchy":{"lvl1":"Useful Tips and Tricks for Developer Notes","lvl2":"Tables"},"content":"Here are the basic features of a table","type":"content","url":"/guides/developer-note-syntax#tables-1","position":23},{"hierarchy":{"lvl1":"Useful Tips and Tricks for Developer Notes","lvl3":"Tables for critical reagents","lvl2":"Tables"},"type":"lvl3","url":"/guides/developer-note-syntax#tables-for-critical-reagents","position":24},{"hierarchy":{"lvl1":"Useful Tips and Tricks for Developer Notes","lvl3":"Tables for critical reagents","lvl2":"Tables"},"content":" :sync: tab0-1 \n\nhello this is a text block| Condition | Description |\n| --- | --- |\n| No Folinic Acid  | Energy mix made without folinic acid. |\n| Folinic  | Folinic acid dissolved in water, added to energy mix. |\n| Folinic + MTHFS  | Folinic acid dissolved in water, added to energy mix + 0.07 µg/uL MTHFS supplemented to PURE reaction.  |\n| 5,10-methenyl-THF | Folinic acid pre-converted using Shimizu’s method. |\n| Positive Control | Standard NEB PURExpress reaction. |\n| Negative Control | NEB PURExpress without input DNA. |\n\nWill appear as...\n\nCondition\n\nDescription\n\nNo Folinic Acid\n\nEnergy mix made without folinic acid.\n\nFolinic\n\nFolinic acid dissolved in water, added to energy mix.\n\nFolinic + MTHFS\n\nFolinic acid dissolved in water, added to energy mix + 0.07 µg/uL MTHFS supplemented to PURE reaction.\n\n5,10-methenyl-THF\n\nFolinic acid pre-converted using Shimizu’s method.\n\nPositive Control\n\nStandard NEB PURExpress reaction.\n\nNegative Control\n\nNEB PURExpress without input DNA.\n\n :sync: tab0-2 \n\nhello this is a text block| Condition | Description |\n| --- | --- |\n| No Folinic Acid  | Energy mix made without folinic acid. |\n| Folinic  | Folinic acid dissolved in water, added to energy mix. |\n| Folinic + MTHFS  | Folinic acid dissolved in water, added to energy mix + 0.07 µg/uL MTHFS supplemented to PURE reaction.  |\n| 5,10-methenyl-THF | Folinic acid pre-converted using Shimizu’s method. |\n| Positive Control | Standard NEB PURExpress reaction. |\n| Negative Control | NEB PURExpress without input DNA. |\n\nWill appear as...\n\nCondition\n\nDescription\n\nNo Folinic Acid\n\nEnergy mix made without folinic acid.\n\nFolinic\n\nFolinic acid dissolved in water, added to energy mix.\n\nFolinic + MTHFS\n\nFolinic acid dissolved in water, added to energy mix + 0.07 µg/uL MTHFS supplemented to PURE reaction.\n\n5,10-methenyl-THF\n\nFolinic acid pre-converted using Shimizu’s method.\n\nPositive Control\n\nStandard NEB PURExpress reaction.\n\nNegative Control\n\nNEB PURExpress without input DNA.","type":"content","url":"/guides/developer-note-syntax#tables-for-critical-reagents","position":25},{"hierarchy":{"lvl1":"Useful Tips and Tricks for Developer Notes","lvl3":"Tables for DNA parts","lvl2":"Tables"},"type":"lvl3","url":"/guides/developer-note-syntax#tables-for-dna-parts","position":26},{"hierarchy":{"lvl1":"Useful Tips and Tricks for Developer Notes","lvl3":"Tables for DNA parts","lvl2":"Tables"},"content":"","type":"content","url":"/guides/developer-note-syntax#tables-for-dna-parts","position":27},{"hierarchy":{"lvl1":"Useful Tips and Tricks for Developer Notes","lvl3":"Tables to complement figures","lvl2":"Tables"},"type":"lvl3","url":"/guides/developer-note-syntax#tables-to-complement-figures","position":28},{"hierarchy":{"lvl1":"Useful Tips and Tricks for Developer Notes","lvl3":"Tables to complement figures","lvl2":"Tables"},"content":"","type":"content","url":"/guides/developer-note-syntax#tables-to-complement-figures","position":29},{"hierarchy":{"lvl1":"Useful Tips and Tricks for Developer Notes","lvl3":"Creating a table from a Jupyter Notebook","lvl2":"Tables"},"type":"lvl3","url":"/guides/developer-note-syntax#creating-a-table-from-a-jupyter-notebook","position":30},{"hierarchy":{"lvl1":"Useful Tips and Tricks for Developer Notes","lvl3":"Creating a table from a Jupyter Notebook","lvl2":"Tables"},"content":"","type":"content","url":"/guides/developer-note-syntax#creating-a-table-from-a-jupyter-notebook","position":31},{"hierarchy":{"lvl1":"Developer Notes"},"type":"lvl1","url":"/guides/developer-notes/developer-notes","position":0},{"hierarchy":{"lvl1":"Developer Notes"},"content":"","type":"content","url":"/guides/developer-notes/developer-notes","position":1},{"hierarchy":{"lvl1":"Developer Notes","lvl2":"Overview"},"type":"lvl2","url":"/guides/developer-notes/developer-notes#overview","position":2},{"hierarchy":{"lvl1":"Developer Notes","lvl2":"Overview"},"content":"This guide will introduce you to Developer Notes (DevNotes) as a way to quickly share ideas and results with the developer community. This guide assumes that you have familiarized yourself with Nucleus Hub Nucleus Hub..","type":"content","url":"/guides/developer-notes/developer-notes#overview","position":3},{"hierarchy":{"lvl1":"Developer Notes","lvl2":"Using Curvenote Preview to view a DevNote"},"type":"lvl2","url":"/guides/developer-notes/developer-notes#using-curvenote-preview-to-view-a-devnote","position":4},{"hierarchy":{"lvl1":"Developer Notes","lvl2":"Using Curvenote Preview to view a DevNote"},"content":" From the Launcher window, select the icon for Curvenote Preview.\n\n You will see a window (\n\nFigure) that says ‘Please set your Curvenote token:\n\n After navigating to the Curvenote website (\n\nFigure), create a Curvenote account\n\n Create a new blank project and click ‘NEXT’\n\n Go to personal settings (\n\nFigure):\n\n Select ‘API Access’ and click ‘Generate New Token’.\n\n Give the token a useful descrption and select Expiry for the maximum time allowed.\n\n Open a terminal window from the Launcher window and run the command curvenote token set [my-token]\n\n You should see a message that says: Token set for “[curvenote-username]”  at \n\nhttps://​api​.curvenote​.com​/login”\n\n You should now be able to view a DevNote by clicking Curvenote Preview from the Launcher window. Note: it may take up to a minute to populate the following viewer window if this is the first time you using the Preview feature.\n\n click the template/ directory.\n\n Congratulations! You should now see a rendered DevNote file  (\n\nFigure):\n\n\n\n\n\n\n\n","type":"content","url":"/guides/developer-notes/developer-notes#using-curvenote-preview-to-view-a-devnote","position":5},{"hierarchy":{"lvl1":"Developer Notes","lvl2":"Setting up your DevNote"},"type":"lvl2","url":"/guides/developer-notes/developer-notes#setting-up-your-devnote","position":6},{"hierarchy":{"lvl1":"Developer Notes","lvl2":"Setting up your DevNote"},"content":" In the File Directory (left panel), navigate to the /devnotes/ directory and make a copy of the /template/ directory and rename it. Note: we recommend that you always work off of a copy of the template file and never edit the template file itself so that it can serve as a working reference.\n\n Inspect the output of the directory. In the Launcher Window (Main Panel), click Curvenote Preview and then select your renamed template file.\n\n Change the title and author of your DevNote by opening the file curvenote.yml from the File Directory and modify the corresponding fields:# Ensure your title is the same as in your `main.md`\n  title: \"An Unexpected Enzyme in PURE\"  \n  subtitle: \"The enzyme MTHFS is needed for 36 pot PURE\"\n  description:  \n# Add any supporting files to the toc, but ensure that your main manuscript\n# is first is the list. The title field is optional.\n# Authors should have affiliations, emails and ORCIDs if available\n  authors:\n    - name: Sam Cell\n      email: samcell@bnext.bio\n      orcid: 0000-0001-1234-1234\n      affiliations:\n        - b.next","type":"content","url":"/guides/developer-notes/developer-notes#setting-up-your-devnote","position":7},{"hierarchy":{"lvl1":"Developer Notes","lvl3":"Connecting a Jupyer Notebook to a DevNote","lvl2":"Setting up your DevNote"},"type":"lvl3","url":"/guides/developer-notes/developer-notes#connecting-a-jupyer-notebook-to-a-devnote","position":8},{"hierarchy":{"lvl1":"Developer Notes","lvl3":"Connecting a Jupyer Notebook to a DevNote","lvl2":"Setting up your DevNote"},"content":" Navigate to your DevNote’s experimental directory devnotes/my-devnote/experiments/\n\n In your current directory, open a Launcher Window by creating a new tab (”+” button) from the main panel. Click the Template icon, select /analysis/platereader.ipynb, and click GO. Note: there is a working analysis notebook already in the directory to serve as a reference: 20250220-analysis.ipynb.\n\n Link this notebook to your DevNote by including a reference to it in your curvenote.yml file as follows:# Add any supporting files to the toc, but ensure that your main manuscript\n# is first is the list. The title field is optional.\n  toc:\n    - file: main.md\n    - file: ./experiments/experiment-01/my-platereader.ipynb\n      title: Analysis Notebook\n\n  In the newly created Jupyter Notebook, adjust the paths to your platemap and data file respectively.\n\n  Run the notebook cells.\n\n  The figure output of a cell can be referenced in two ways. We recommend using both.\n\n Option 1: save the output of a cell to the /analysis/ directory by adding the following code to the end of the cell:plt.savefig(./analysis/my-fig.png)\n\n Option 2: label the cell by adding the following syntax to the top of the cell:#| label: fig:name-of-figure\n\nNote: complete documentation of MyST Markdown is available online\n\nMyST specification: \n\nhttps://​mystmd​.org​/spec\n\n  If the output of a cell is a table rather than a figure , it can be referenced as follows:\n\n Label the cell by adding the following syntax to the top of the cell:#| label: tbl:name-of-table","type":"content","url":"/guides/developer-notes/developer-notes#connecting-a-jupyer-notebook-to-a-devnote","position":9},{"hierarchy":{"lvl1":"Developer Notes","lvl3":"Reference figures in main.md","lvl2":"Setting up your DevNote"},"type":"lvl3","url":"/guides/developer-notes/developer-notes#reference-figures-in-main-md","position":10},{"hierarchy":{"lvl1":"Developer Notes","lvl3":"Reference figures in main.md","lvl2":"Setting up your DevNote"},"content":"  A figure can be generated in two ways depending on how you want to reference it:\n\n Option 1: reference the saved file::::{figure} ./experiments/experiment-01/my-fig.png\n:name: name-of-fig\n:align: center\n:width: 50%\n\nMy caption\n:::\n\n Option 2: reference the output of a labelled jupyter cell::::{figure} #fig:name-of-figure\n:kind: table\n:name: name-of-fig\n:width: 50%\n\nMy caption\n:::\n\n Multiple figures can be handled elegently by using tabs::::::{tab-set}\n\n::::{tab-item} Tab Title 1\n:sync: tab1\n:::{figure} #fig:name-of-figure-1\n:name: name-of-fig-1\n:align: center\n:width: 50%\n\nMy caption 1\n:::\n::::\n\n::::{tab-item} Tab Title 2\n:sync: tab2\n:::{figure} ./experiments/experiment-01/my-fig-2.png\n:name: name-of-fig-2\n:align: center\n:width: 50%\n\nMy caption 2\n:::\n::::\n\n:::::\n\n A table output can be included from a labelled jupyter cell as follows::::{figure} #tbl:name-of-table\n:kind: table\n:name: name-of-table\n\nMy caption\n:::\n\n Figures and tables can be referenced in documents using the following syntax:This point is illustrated in {ref}`name-of-fig`.\n\n Verify that the changes have been made by clicking Curvenote Preview.","type":"content","url":"/guides/developer-notes/developer-notes#reference-figures-in-main-md","position":11},{"hierarchy":{"lvl1":"Nucleus Hub"},"type":"lvl1","url":"/guides/nucleus-hub/nucleus-hub","position":0},{"hierarchy":{"lvl1":"Nucleus Hub"},"content":"","type":"content","url":"/guides/nucleus-hub/nucleus-hub","position":1},{"hierarchy":{"lvl1":"Nucleus Hub","lvl2":"Overview"},"type":"lvl2","url":"/guides/nucleus-hub/nucleus-hub#overview","position":2},{"hierarchy":{"lvl1":"Nucleus Hub","lvl2":"Overview"},"content":"This guide will introduce you to Nucleus Hub for accessing the Cell Development Kit (CDK) and collaborating with other Nucleus Developers.","type":"content","url":"/guides/nucleus-hub/nucleus-hub#overview","position":3},{"hierarchy":{"lvl1":"Nucleus Hub","lvl2":"Nucleus Hub Registration"},"type":"lvl2","url":"/guides/nucleus-hub/nucleus-hub#nucleus-hub-registration","position":4},{"hierarchy":{"lvl1":"Nucleus Hub","lvl2":"Nucleus Hub Registration"},"content":"Currently, access to Nucleus Hub is available by request to \n\nbuild@bnext.bio.\n\n Navigate to \n\nhub​.nucleus​.engineering.\n\n Follow the prompts to make an account.\n\n After clicking Create User , send an email to \n\nbuild@bnext.bio to approve the account.","type":"content","url":"/guides/nucleus-hub/nucleus-hub#nucleus-hub-registration","position":5},{"hierarchy":{"lvl1":"Nucleus Hub","lvl2":"Orientation"},"type":"lvl2","url":"/guides/nucleus-hub/nucleus-hub#orientation","position":6},{"hierarchy":{"lvl1":"Nucleus Hub","lvl2":"Orientation"},"content":"Upon entering Nucleus Hub you should the following screen:\n\n\n\nFile directory.\n\nLauncher window.\n\nMake a new empty Jupyter Notebook.\n\nMake a new template Jupyter Notebook.\n\nPreview a Developer Note.\n\nOpen a terminal window.\n\nView a draft of a Developer Note.","type":"content","url":"/guides/nucleus-hub/nucleus-hub#orientation","position":7},{"hierarchy":{"lvl1":"Nucleus Hub","lvl2":"Accessing the Cell Development Kit"},"type":"lvl2","url":"/guides/nucleus-hub/nucleus-hub#accessing-the-cell-development-kit","position":8},{"hierarchy":{"lvl1":"Nucleus Hub","lvl2":"Accessing the Cell Development Kit"},"content":"Nucleus Hub makes it easy to access the CDK to design and analyze experiments. This section will demonstrate a simple workflow for analyzing fluorescence time series data obtained from a microplate reader.\n\n Open the /sample-data/ directory.\n\n Click the Template icon, select /analysis/platereader.ipynb, and click GO.\n\n Run the first cell to import the platereader library from the CDK.\n\n Modify the variables data_path and platemap_path in the second cell to reference the corresponding files in the /sample-data/ directory and run the cell to load the data.\n\n Generate basic plots using the function pr.plot_curves()\n\n These plots can then be incorporated into a Developer Note. See \n\nDeveloper Notes for more information.\n\nIf you are a newcomer to Python and Jupyter the following links may be helpful:\n\nBeginner Python tutorial [\n\nlink].\n\nIntroduction to the Pandas library [\n\nlink].\n\nIntroduction to JupyterLab and Jupyter Notebooks [\n\nlink].","type":"content","url":"/guides/nucleus-hub/nucleus-hub#accessing-the-cell-development-kit","position":9},{"hierarchy":{"lvl1":"Nucleus Hub","lvl2":"Collaboration options"},"type":"lvl2","url":"/guides/nucleus-hub/nucleus-hub#collaboration-options","position":10},{"hierarchy":{"lvl1":"Nucleus Hub","lvl2":"Collaboration options"},"content":"Currently, Nucleus Hub supports two options for collaborating with other developers:\n\nOption 1: share your entire workspace by generating a shared link. Any existing Nucleus Hub user will be able to read and write to documents in your workspace.\n\nClick to the Generate a Shared Link icon at the top right corner of the workspace.\n\nOption 2: create a collaborative workspace. This will create a special workspace to which a select group of authorized users will have read and write access to documents within that workspace. This option allows users to ensure that their personal workspace remains private.\n\nRequest a collaborative workspace by reaching out to \n\nbuild@bnext.bio.","type":"content","url":"/guides/nucleus-hub/nucleus-hub#collaboration-options","position":11},{"hierarchy":{"lvl1":"Tutorials"},"type":"lvl1","url":"/guides/tutorials","position":0},{"hierarchy":{"lvl1":"Tutorials"},"content":"Tutorials are a type of Guide that tie together documentation into useful groups and add a bit more narrative exposition.","type":"content","url":"/guides/tutorials","position":1},{"hierarchy":{"lvl1":"Tutorials","lvl2":"In the Lab"},"type":"lvl2","url":"/guides/tutorials#in-the-lab","position":2},{"hierarchy":{"lvl1":"Tutorials","lvl2":"In the Lab"},"content":"From Zero to DevNote\n\nAssembling Base Cytosol\n\nAssembling Base Cell","type":"content","url":"/guides/tutorials#in-the-lab","position":3},{"hierarchy":{"lvl1":"Tutorials","lvl2":"Nucleus Hub"},"type":"lvl2","url":"/guides/tutorials#nucleus-hub","position":4},{"hierarchy":{"lvl1":"Tutorials","lvl2":"Nucleus Hub"},"content":" - [Nucleus Hub](https://antonrmolina.github.io/nucleus-distribution-pages/docs/tutorials/hub/nucleus-hub) \n\nNucleus Hub\n\nGetting Started with Nucleus Hub\n\nUnderstanding the CDK\n\nWorkbook Templates","type":"content","url":"/guides/tutorials#nucleus-hub","position":5},{"hierarchy":{"lvl1":"Tutorials","lvl2":"Developer Notes"},"type":"lvl2","url":"/guides/tutorials#developer-notes","position":6},{"hierarchy":{"lvl1":"Tutorials","lvl2":"Developer Notes"},"content":" - [Developer Notes](https://antonrmolina.github.io/nucleus-distribution-pages/docs/tutorials/devnotes/developer-notes) \n\nDeveloper Notes\n\nWriting your first Developer Note\n\nUseful Tips and Tricks for Developer Notes","type":"content","url":"/guides/tutorials#developer-notes","position":7},{"hierarchy":{"lvl1":"Nucleus Distribution"},"type":"lvl1","url":"/","position":0},{"hierarchy":{"lvl1":"Nucleus Distribution"},"content":"","type":"content","url":"/","position":1},{"hierarchy":{"lvl1":"Nucleus Distribution","lvl2":"TODO list"},"type":"lvl2","url":"/#todo-list","position":2},{"hierarchy":{"lvl1":"Nucleus Distribution","lvl2":"TODO list"},"content":"","type":"content","url":"/#todo-list","position":3},{"hierarchy":{"lvl1":"Nucleus Distribution","lvl3":"Getting started","lvl2":"TODO list"},"type":"lvl3","url":"/#getting-started","position":4},{"hierarchy":{"lvl1":"Nucleus Distribution","lvl3":"Getting started","lvl2":"TODO list"},"content":"Introduction\n\ncopy editing\n\nRoadmap page\n\ncopy editing\n\nfigure: whitespace chart?\n\nfigure: universal chassis?\n\nNucleus Workflow -> we can likely hide this one if pressed for time and stick with just Zero to DevNote...\n\ncopy editing\n\ndefine minimal set of guides\n\nZero to DevNote\n\nMinnimal set of guides\n\nMake base cytosol from kit\n\nGetting started with Nucleus Hub\n\nWriting your first DevNote\n\nNavigating the forum\n\n[In progress] Contribution guides","type":"content","url":"/#getting-started","position":5},{"hierarchy":{"lvl1":"Nucleus Distribution","lvl3":"Docs","lvl2":"TODO list"},"type":"lvl3","url":"/#docs","position":6},{"hierarchy":{"lvl1":"Nucleus Distribution","lvl3":"Docs","lvl2":"TODO list"},"content":"how to handle bill of materials?\n\ntemplate platemap and composition spec sheet","type":"content","url":"/#docs","position":7},{"hierarchy":{"lvl1":"Nucleus Distribution","lvl4":"DNA Distribution","lvl3":"Docs","lvl2":"TODO list"},"type":"lvl4","url":"/#dna-distribution","position":8},{"hierarchy":{"lvl1":"Nucleus Distribution","lvl4":"DNA Distribution","lvl3":"Docs","lvl2":"TODO list"},"content":"copy edits\n\n[ACJS/JEC] need to think about how to upgrade this as well as ops for pushing DNA into distribution","type":"content","url":"/#dna-distribution","position":9},{"hierarchy":{"lvl1":"Nucleus Distribution","lvl4":"Modules","lvl3":"Docs","lvl2":"TODO list"},"type":"lvl4","url":"/#modules","position":10},{"hierarchy":{"lvl1":"Nucleus Distribution","lvl4":"Modules","lvl3":"Docs","lvl2":"TODO list"},"content":"plamGFP module\n\nPOPC/chol module","type":"content","url":"/#modules","position":11},{"hierarchy":{"lvl1":"Nucleus Distribution","lvl4":"Processes","lvl3":"Docs","lvl2":"TODO list"},"type":"lvl4","url":"/#processes","position":12},{"hierarchy":{"lvl1":"Nucleus Distribution","lvl4":"Processes","lvl3":"Docs","lvl2":"TODO list"},"content":"[migrate - in progress] Make amino acid + unit test experiment\n\n[migrate - in progress] Make SM mix\n\n[SY] OnePot Pure\n\n[JEC] 36Pot PURE\n\n[JEC] Assemble Base Cytosol from Kit\n\n[migrate YH/SY] Base Cell","type":"content","url":"/#processes","position":13},{"hierarchy":{"lvl1":"Nucleus Distribution","lvl4":"Implementations","lvl3":"Docs","lvl2":"TODO list"},"type":"lvl4","url":"/#implementations","position":14},{"hierarchy":{"lvl1":"Nucleus Distribution","lvl4":"Implementations","lvl3":"Docs","lvl2":"TODO list"},"content":"[SY] Detector cell\n\n[SY] Responder cell\n\n[SY] Emitter cell\n\n[YH/SY] Cx43\n\n[YH] PPK cell","type":"content","url":"/#implementations","position":15},{"hierarchy":{"lvl1":"Nucleus Distribution","lvl3":"Guides","lvl2":"TODO list"},"type":"lvl3","url":"/#guides","position":16},{"hierarchy":{"lvl1":"Nucleus Distribution","lvl3":"Guides","lvl2":"TODO list"},"content":"How to make base cytosol\n\nHow to make base cell\n\nHow to Forum\n\nHow to Nucleus Hub\n\nHow to DevNotes","type":"content","url":"/#guides","position":17},{"hierarchy":{"lvl1":"Nucleus Distribution","lvl3":"About","lvl2":"TODO list"},"type":"lvl3","url":"/#about","position":18},{"hierarchy":{"lvl1":"Nucleus Distribution","lvl3":"About","lvl2":"TODO list"},"content":"copy writing open science\n\ncopy writing license\n\nupdate FAQs\n\nRelease notes v0.4.0>","type":"content","url":"/#about","position":19},{"hierarchy":{"lvl1":"Nucleus Distribution","lvl3":"Scripting","lvl2":"TODO list"},"type":"lvl3","url":"/#scripting","position":20},{"hierarchy":{"lvl1":"Nucleus Distribution","lvl3":"Scripting","lvl2":"TODO list"},"content":"scripts for all rendered PDFs\n\n","type":"content","url":"/#scripting","position":21},{"hierarchy":{"lvl1":"Nucleus Distribution","lvl3":"Site","lvl2":"TODO list"},"type":"lvl3","url":"/#site","position":22},{"hierarchy":{"lvl1":"Nucleus Distribution","lvl3":"Site","lvl2":"TODO list"},"content":"Revamp Nucleus Logo?\n\nFinalize NavBar link outs and synchronize across all websites\n\nHandle darkmode; either disable or include darkmode logo\n\nAdd favicon\n\nfix typst template \nThe Nucleus Distribution is an open source package for synthetic cell builders maintained by b.next. The Distribution includes integrated digital tools, biological materials, documentation, and validated protocols for the full process of cell building, including cytosol construction, DNA content engineering, and membrane encapsulation. \n\nJoin the mailing list and contact us at build@bnext.bio.\n\nThe sixth stable release of the Nucleus Distribution (v0.4.0) is now available. To learn more about the latest updates, check out the latest [release notes](docs/about/release-notes/release-notes-v0_4_0.md). The Distribution is supported by the Astera Institute, Sloan Foundation, and Caltech.\n\n:::{card} \n:header: **Get started** \n:link: docs/guides/getting-started.md\n\nLearn how to navigate this documentation and build your first cytosols and cells.\n:::  ::::{grid} 1 1 2 3  :::{card}\n:header: Collections\n:link: docs/collections/collections-main.md\nA collection of useful instances of compatible processes and modules\n:::\n\n:::{card}\n:header: Processes\n:link: docs/processes/processes-main.md\n\nA process converts a Module into something useful.\n:::\n\n:::{card}\n:header: Modules\n:link: docs/modules/modules-main.md\n\nA module is a useful biochemical formulation, often incorporating a genetically encoded component. \n:::\n::::  ```{card} \n:header: Guides\nUser guides for Nucleus Hub and Nucleus Developer Notes live here:\n\n- Making synthetic cells for beginners\n- Nucleus Hub\n- Developer Notes\n```  ```{card} \n:header: Community\n\n- Collaborators\n- Get involved\n```  ```{card} \n:header: About\n\n- About Nucleus\n- [Release Notes](./docs/about/release-notes.md)\n- [FAQs](./docs/about/faqs.md)\n``` ","type":"content","url":"/#site","position":23},{"hierarchy":{"lvl1":"Nucleus Workflow"},"type":"lvl1","url":"/start/contribute","position":0},{"hierarchy":{"lvl1":"Nucleus Workflow"},"content":"This document describes at a high level the end-to-end workflow of using and contributing to the Nucleus Distribution. [optional] The following page describes each step in much greater detail.\n\nIt is interesting to consider that since there is substantial cost and effort to get started as a user, the marginal cost of contributing is rather small. This means every user ought to be a constributor.","type":"content","url":"/start/contribute","position":1},{"hierarchy":{"lvl1":"Nucleus Workflow","lvl2":"Sourcing materials"},"type":"lvl2","url":"/start/contribute#sourcing-materials","position":2},{"hierarchy":{"lvl1":"Nucleus Workflow","lvl2":"Sourcing materials"},"content":"It all starts with sourcing materials. Most materials are bought from third party vendors. Every instance includes a bill of materials and recommended vendors to source them from. Other materials such as the plasmids contained in the Nucleus DNA Distribution and Nucleus Reagent Kits can be acquired from b.next.\n\nInstance bill of material\n\nNucleus DNA Distribution\n\nNucleus Reagent Kits","type":"content","url":"/start/contribute#sourcing-materials","position":3},{"hierarchy":{"lvl1":"Nucleus Workflow","lvl2":"Preparing your lab for synthetic cell work"},"type":"lvl2","url":"/start/contribute#preparing-your-lab-for-synthetic-cell-work","position":4},{"hierarchy":{"lvl1":"Nucleus Workflow","lvl2":"Preparing your lab for synthetic cell work"},"content":"We have a number of guide that walk you through best practices for making and storing foundational stocks so that you can easily get started working on cytosols, cells, and assemblies.\n\nguide for buffers\n\nguide for transformations\n\nbest practices for experimental design","type":"content","url":"/start/contribute#preparing-your-lab-for-synthetic-cell-work","position":5},{"hierarchy":{"lvl1":"Nucleus Workflow","lvl2":"Make an instance"},"type":"lvl2","url":"/start/contribute#make-an-instance","position":6},{"hierarchy":{"lvl1":"Nucleus Workflow","lvl2":"Make an instance"},"content":"Most people will want to make a specific instance to build upon and modify for their own work. In this case we will use plamGFP cytosol as an example. Review the protocol accompanying documentation before going into the lab. Most instances will include one or more Processes or Modules.\n\n[There should be something here about how to plan an experiment and what a Nucleus compatible platemap format should be; the platemap format can be included in the Instance Template so that people can more easily contribute data as a validation DevNote]\n\nplamGFP Instance","type":"content","url":"/start/contribute#make-an-instance","position":7},{"hierarchy":{"lvl1":"Nucleus Workflow","lvl2":"Analyze the data in Nucleus Hub"},"type":"lvl2","url":"/start/contribute#analyze-the-data-in-nucleus-hub","position":8},{"hierarchy":{"lvl1":"Nucleus Workflow","lvl2":"Analyze the data in Nucleus Hub"},"content":"Having made an instance of the plamGFP cytosol you will also have your own performance data. The performance data can be analyzed using the Cell Development Kit (CDK) which can be accessed on Nucleus Hub.\n\nNucleus Hub Guide","type":"content","url":"/start/contribute#analyze-the-data-in-nucleus-hub","position":9},{"hierarchy":{"lvl1":"Nucleus Workflow","lvl2":"Share your data as Developer Note"},"type":"lvl2","url":"/start/contribute#share-your-data-as-developer-note","position":10},{"hierarchy":{"lvl1":"Nucleus Workflow","lvl2":"Share your data as Developer Note"},"content":"Now that you have analyzed your data using Jupyter Hub, you can quickly share your data with the Developer Community. While using a off-the-shelf reagent kit to express plamGFP might seem like a small feat, sharing replication data when benchmarked correctly is a valuable contribution and let’s the rest of the Developer Community know that you committed to building reproducible synthetic cells that work.\n\nDeveloper Note Guide","type":"content","url":"/start/contribute#share-your-data-as-developer-note","position":11},{"hierarchy":{"lvl1":"Nucleus Workflow","lvl2":"Integration into the Distribution"},"type":"lvl2","url":"/start/contribute#integration-into-the-distribution","position":12},{"hierarchy":{"lvl1":"Nucleus Workflow","lvl2":"Integration into the Distribution"},"content":"Every three months Developer Notes are reviewed by the core development team and integrated into the distribution to ensure quality and interoperability. We focus on contributions that are regarded as highly useful to the developer community or are very well aligned with the technical roadmap.\n\nWe have a strong preference for contributions that adhere to the Module Contribution Criteria.\n\nCytosol Module Contribution Guidelines\n\nSynthetic Cell Contribution Guidelines\n\nIf you are developing a module whose performance not be properly assessed by one of these criteria, we would invite a Developer Note suggesting a proper criteria.","type":"content","url":"/start/contribute#integration-into-the-distribution","position":13},{"hierarchy":{"lvl1":"From Zero to DevNote"},"type":"lvl1","url":"/start/first-guide","position":0},{"hierarchy":{"lvl1":"From Zero to DevNote"},"content":"","type":"content","url":"/start/first-guide","position":1},{"hierarchy":{"lvl1":"From Zero to DevNote","lvl2":"Overview"},"type":"lvl2","url":"/start/first-guide#overview","position":2},{"hierarchy":{"lvl1":"From Zero to DevNote","lvl2":"Overview"},"content":"The purpose of this page is to guide a newcomer through the complete Nucleus technology stack and workflows from making base cytosol to posting a Developer Note (DevNote) that reports on it’s performance. Since this is likely the first Nucleus Guide you have encourntered, it will walk through every step with a significant amount of detail. In general, guides tie together documentation from across the site into useful workflows.","type":"content","url":"/start/first-guide#overview","position":3},{"hierarchy":{"lvl1":"From Zero to DevNote","lvl3":"Making Base Cytosol","lvl2":"Overview"},"type":"lvl3","url":"/start/first-guide#making-base-cytosol","position":4},{"hierarchy":{"lvl1":"From Zero to DevNote","lvl3":"Making Base Cytosol","lvl2":"Overview"},"content":"There are many different ways to make the base cytosol. This distribution includes documentation for making it yourself from scratch. An open-formulation version can also be obtained from b.next. Since the goal of this guide is provide detailed introduction to the whole Nucleus Workflow, we’ll start with the Base Cytosol Kit.\n\nMake Base Cytosol from Kit\n\nIf you follow the steps on that page, you shoud find yourself with some data in hand ready to be analyzed. Rather firing up Excel or opening a Google Sheet, we’re going to sign into Nucleus Hub.","type":"content","url":"/start/first-guide#making-base-cytosol","position":5},{"hierarchy":{"lvl1":"From Zero to DevNote","lvl3":"Analyzing Data with Nucleus Hub","lvl2":"Overview"},"type":"lvl3","url":"/start/first-guide#analyzing-data-with-nucleus-hub","position":6},{"hierarchy":{"lvl1":"From Zero to DevNote","lvl3":"Analyzing Data with Nucleus Hub","lvl2":"Overview"},"content":"Nucleus Hub is an interactive computing platform built on Jupyter Hub. Like it or not, we have to interact with software to get our work done and share it with others. Nucleus Hub provides a way of accessing software tools that just work. No installs, no compiling, no environmental management. Of course if you want to modify your own environments and build code, that’s supported as well. The Nucleus CDK lives on GitHub, but the Hub is preconfigured to get you up and running without any additional work. And there’s templates.\n\nGetting Started with Nucleus Hub\n\nIf you followed the steps on that page, you should not find yourself with a Nucleus Hub account and some nice looking plots. Let’s tell the Nucleus Community what you’ve been up to and write up a DevNote.","type":"content","url":"/start/first-guide#analyzing-data-with-nucleus-hub","position":7},{"hierarchy":{"lvl1":"From Zero to DevNote","lvl3":"Sharing your results as a Developer Note","lvl2":"Overview"},"type":"lvl3","url":"/start/first-guide#sharing-your-results-as-a-developer-note","position":8},{"hierarchy":{"lvl1":"From Zero to DevNote","lvl3":"Sharing your results as a Developer Note","lvl2":"Overview"},"content":"Nucleus is open source which means that we’re building something together. Developer Notes are the key way to contribute to the Nucleus Distribution and gain legend status in the community. Developer Notes are conveniently built ontop of Jupyter Notebooks and MyST Markdown (a flavor of markdown designed for technical communication). Since you’ve done your analysis in a Jupyter Notebook, you’ve already half-written your DevNote and you didn’t even know it.\n\nWriting your first Developer Note\n\nIf you followed the steps on that page, you should have successfully posted a Developer Note. Not only does your data help us understand how good you are preparing base cytosols (and how well our reagents are performing), it helps expand the largest on-going interlab study on the expression of plamGFP. It also introduces you to the Developer Community, in a uniquely Nucleus Way.","type":"content","url":"/start/first-guide#sharing-your-results-as-a-developer-note","position":9},{"hierarchy":{"lvl1":"From Zero to DevNote","lvl3":"Engage with the community on the Nucleus Forum","lvl2":"Overview"},"type":"lvl3","url":"/start/first-guide#engage-with-the-community-on-the-nucleus-forum","position":10},{"hierarchy":{"lvl1":"From Zero to DevNote","lvl3":"Engage with the community on the Nucleus Forum","lvl2":"Overview"},"content":"Once a DevNote goes live, a thread is opened on the Forum for others to discuss. People might ask you how to replicate what you did, tell you that you made an incredible mistake, or just say “hi”. These “Hello, World!” DevNotes go into a special channel and provide a place for people to introduce themselves.\n\nNavigating the Nucleus Forum","type":"content","url":"/start/first-guide#engage-with-the-community-on-the-nucleus-forum","position":11},{"hierarchy":{"lvl1":"From Zero to DevNote","lvl3":"Am I a Developer Now?","lvl2":"Overview"},"type":"lvl3","url":"/start/first-guide#am-i-a-developer-now","position":12},{"hierarchy":{"lvl1":"From Zero to DevNote","lvl3":"Am I a Developer Now?","lvl2":"Overview"},"content":"Well, not quite. To be a proper Nucleus Developer, you should probably have developed something. But don’t fret, you’re well on your way. You are now in command of a growing collection of validated Modules that you can build ontop of and equipped with the tools to analyze and share them. If you Develop something useful or something on the Nucleus Roadmap you should keep in mind the Nucleus Contribution Standards, they are the things you should keep in mind as you go about your work so that it’ll end up as part of the distribution.\n\nNucleus Distribution Standards\n\nOnce it’s in the Distribution, you can safely call yourself a Developer. Getting Started with Nucleus\nThis guide walks you through the complete Nucleus workflow: from preparing base cytosol to analyzing results and sharing them with the community. By the end, you'll understand how the pieces fit together and be ready to contribute your own work.\nPrerequisites\n\nBasic lab skills for molecular biology\nFamiliarity with Python and Jupyter notebooks (helpful but not required)\nA willingness to share your work openly\n\nWhat You'll Learn\n\nHow to prepare base cytosol using the kit\nHow to analyze your data on Nucleus Hub\nHow to document your work as a Developer Note\nHow to engage with the Nucleus community\n\nStep 1: Prepare Base Cytosol\nThe Nucleus Distribution includes multiple approaches for preparing base cytosol. For this tutorial, we'll use the Base Cytosol Kit, which provides a standardized starting point.\nFollow the protocol: Making Base Cytosol from Kit\nOnce complete, you should have:\n\nPrepared cytosol samples\nFluorescence measurements or other assay data\nRaw data files ready for analysis\n\nStep 2: Analyze Your Data\nNucleus Hub is a JupyterHub-based platform that provides pre-configured analysis environments. No installation required—just log in and start working.\nWhy use Nucleus Hub?\n\nPre-installed tools and libraries\nReproducible computational environments\nAnalysis templates for common workflows\nDirect integration with the Nucleus Distribution\n\nGet started: Introduction to Nucleus Hub\nAfter completing the tutorial, you'll have:\n\nA Nucleus Hub account\nAnalysis notebooks with your results\nPlots and summary statistics\n\nStep 3: Share Your Results\nDeveloper Notes (DevNotes) are how we document and share work in Nucleus. They're built on Jupyter notebooks and MyST Markdown, so if you've already done your analysis in a notebook, you're halfway done.\nWhat makes a good DevNote?\n\nClear documentation of methods\nReproducible analysis code\nDiscussion of results and limitations\nLinks to relevant protocols and modules\n\nWrite your first DevNote: Developer Note Guide\nYour DevNote contributes to the community in two ways:\n\nIt documents real-world performance of Nucleus modules\nIt adds to our growing dataset of cell-free expression experiments\n\nStep 4: Join the Discussion\nWhen your DevNote is published, a forum thread opens automatically for discussion. Community members may ask questions, suggest improvements, or build on your work.\nLearn more: Forum Guidelines\nNext Steps\nYou've now completed the core Nucleus workflow. You know how to prepare reagents, analyze data, and share results. To become a more active contributor:\nBuild New Modules\nUse existing validated components to create new functionality. Document your work thoroughly and test across conditions.\nImprove Existing Protocols\nFound a way to improve yield or reduce cost? Document your modifications and share the results.\nReview the Contribution Standards\nBefore submitting work to the Distribution, review our standards for documentation, validation, and licensing: Contribution Standards\nQuestions?\n\nCheck the FAQ\nSearch the Forum\nOpen an issue on GitHub\n\nWelcome to Nucleus. We're building this together. ","type":"content","url":"/start/first-guide#am-i-a-developer-now","position":13},{"hierarchy":{"lvl1":"Introduction"},"type":"lvl1","url":"/start/getting-started","position":0},{"hierarchy":{"lvl1":"Introduction"},"content":"","type":"content","url":"/start/getting-started","position":1},{"hierarchy":{"lvl1":"Introduction","lvl2":"Overview"},"type":"lvl2","url":"/start/getting-started#overview","position":2},{"hierarchy":{"lvl1":"Introduction","lvl2":"Overview"},"content":"The Nucleus Distribution is an open source package for synthetic cell builders maintained by b.next. The Distribution includes integrated digital tools, biological materials, documentation, and validated protocols for the full process of cell building, including cytosol construction, DNA content engineering, and membrane encapsulation.\n\nJoin the mailing list and contact us at \n\nbuild@bnext.bio.\n\nThe sixth stable release of the Nucleus Distribution (v0.4.0) is now available. To learn more about the latest updates, check out the latest \n\nrelease notes. The Distribution is supported by the Astera Institute, Sloan Foundation, and Caltech. :::{card} \n:header: **Get started** \n:link: docs/guides/getting-started.md\n\nLearn how to navigate this documentation and build your first cytosols and cells.\n::: ","type":"content","url":"/start/getting-started#overview","position":3},{"hierarchy":{"lvl1":"Introduction","lvl3":"Navigate the Documentation","lvl2":"Overview"},"type":"lvl3","url":"/start/getting-started#navigate-the-documentation","position":4},{"hierarchy":{"lvl1":"Introduction","lvl3":"Navigate the Documentation","lvl2":"Overview"},"content":"This documentation is organized into three categories:\n\nMaybe include a schematic of somekind showing how the categories and subcategories relate relate?\n\nModule\n\nProcesses\n\nCollections\n\nEach of these categories is further broken down into the following types:\n\nCytosols\n\nCells\n\nAssemblies\n\nAnts","type":"content","url":"/start/getting-started#navigate-the-documentation","position":5},{"hierarchy":{"lvl1":"Introduction","lvl3":"Start with collections and work backwards","lvl2":"Overview"},"type":"lvl3","url":"/start/getting-started#start-with-collections-and-work-backwards","position":6},{"hierarchy":{"lvl1":"Introduction","lvl3":"Start with collections and work backwards","lvl2":"Overview"},"content":"We recommend looking through the collection of instances to get started. Each instance will contain the following:\n\nBill of materials (BOM) with product numbers and link-outs to vendor websites.\n\nLab-ready protocol that includes materials that you should have at your bench and a step-by-step guide for recreating the instance.\n\nQuantiative data showing the expected behavior of the instance.\n\nReferences  that include the Modules and Processes used to create the Instance as well as any supporting DevNotes.\n\nThe PURE cell is a favorite example.","type":"content","url":"/start/getting-started#start-with-collections-and-work-backwards","position":7},{"hierarchy":{"lvl1":"Introduction","lvl3":"Guides contain a wealth of valuable information","lvl2":"Overview"},"type":"lvl3","url":"/start/getting-started#guides-contain-a-wealth-of-valuable-information","position":8},{"hierarchy":{"lvl1":"Introduction","lvl3":"Guides contain a wealth of valuable information","lvl2":"Overview"},"content":"The guides will help you get started.","type":"content","url":"/start/getting-started#guides-contain-a-wealth-of-valuable-information","position":9},{"hierarchy":{"lvl1":"Introduction","lvl3":"Technical Roadmap","lvl2":"Overview"},"type":"lvl3","url":"/start/getting-started#technical-roadmap","position":10},{"hierarchy":{"lvl1":"Introduction","lvl3":"Technical Roadmap","lvl2":"Overview"},"content":"We are building these tools to build a common system","type":"content","url":"/start/getting-started#technical-roadmap","position":11},{"hierarchy":{"lvl1":"Technical Roadmap"},"type":"lvl1","url":"/start/roadmap","position":0},{"hierarchy":{"lvl1":"Technical Roadmap"},"content":"","type":"content","url":"/start/roadmap","position":1}]}